[
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_31.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_31.jpg",
        "caption": "KPN TERIMA DARJAH UTAMA BAKTI CEMERLANG DARIPADA PRESIDEN REPUBLIK SINGAPURASingapura, 12 Jun 2025 Ketua Polis Negara (KPN), IG Tan Sri Razarudin Husain telah dikurniakan Darjah Utama Bakti Cemerlang (Distinguished Service Order) oleh Presiden Republik Singapura, Tuan Yang Terutama Tharman Shanmugaratnam dalam satu istiadat rasmi yang berlangsung di The Istana, Orchard Road, semalam.Pengurniaan darjah itu merupakan antara penghormatan tertinggi Kerajaan Singapura kepada tokoh luar negara yang telah menunjukkan komitmen luar biasa, khususnya pencapaian cemerlang Tan Sri Razarudin dalam memperkukuh kerjasama keselamatan serta hubungan dua hala antara Polis Diraja Malaysia dan Pasukan Polis Singapura (SPF).Sempena lawatan rasmi itu, Tan Sri Razarudin turut mengadakan kunjungan hormat ke atas Pemangku Pesuruhjaya Polis Singapura, DCP Lian Ghim Hua di Ibu Pejabat SPF, New Phoenix Park.Beliau bersama isteri yang juga Pengerusi Persatuan Keluarga Polis Malaysia, Puan Sri Datuk Zainah Othman turut menghadiri Majlis Makan Malam Rasmi yang berlangsung di Senior Police Officers Mess. Majlis turut dihadiri para pegawai kanan SPF.Mengakhiri lawatan rasmi ke negara tersebut, Tan Sri Razarudin telah mengadakan kunjungan hormat ke atas Perdana Menteri Singapura, H.E. Mr. Lawrence Wong yang berlangsung di The Istana, Orchard Road, pagi tadi.Hadir sama, bekas Ketua Urus Setia KPN (Perhubungan Antarabangsa) Bukit Aman, pesara SAC Dato Pahlawan Suparamaniam Ramasamy dan ACP Perhubungan Antarabangsa, ACP Loh Pey Pey.Sumber gambar: Singapore Police Force",
        "cleaned_caption": "KPN TERIMA DARJAH UTAMA BAKTI CEMERLANG DARIPADA PRESIDEN REPUBLIK SINGAPURA\n\nSingapura, 12 Jun 2025 Ketua Polis Negara (KPN), IG telah dikurniakan Darjah Utama Bakti Cemerlang (Distinguished Service Order) oleh Presiden Republik Singapura dalam satu istiadat rasmi yang berlangsung di The Istana, Orchard Road, semalam. Pengurniaan darjah itu merupakan antara penghormatan tertinggi Kerajaan Singapura kepada tokoh luar negara yang telah menunjukkan komitmen luar biasa, khususnya pencapaian cemerlang dalam memperkukuh kerjasama keselamatan serta hubungan dua hala antara Polis Diraja Malaysia dan Pasukan Polis Singapura (SPF).\n\nSempena lawatan rasmi itu, IG turut mengadakan kunjungan hormat ke atas Pemangku Pesuruhjaya Polis Singapura di Ibu Pejabat SPF, New Phoenix Park. Beliau bersama isteri yang juga Pengerusi Persatuan Keluarga Polis Malaysia turut menghadiri Majlis Makan Malam Rasmi yang berlangsung di Senior Police Officers Mess. Majlis turut dihadiri para pegawai kanan SPF.\n\nMengakhiri lawatan rasmi ke negara tersebut, IG telah mengadakan kunjungan hormat ke atas Perdana Menteri Singapura yang berlangsung di The Istana, Orchard Road, pagi tadi. Hadir sama, bekas Ketua Urus Setia KPN (Perhubungan Antarabangsa) Bukit Aman, pesara dan ACP Perhubungan Antarabangsa. \n\nSumber gambar: Singapore Police Force",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the significance of the ceremony in which the Ketua Polis Negara is receiving the Darjah Utama Bakti Cemerlang?\n",
        "question_and_answers": {
            "question_0": "What is the significance of the ceremony in which the Ketua Polis Negara is receiving the Darjah Utama Bakti Cemerlang?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_33.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_33.jpg",
        "caption": "KPN TERIMA DARJAH UTAMA BAKTI CEMERLANG DARIPADA PRESIDEN REPUBLIK SINGAPURASingapura, 12 Jun 2025 Ketua Polis Negara (KPN), IG Tan Sri Razarudin Husain telah dikurniakan Darjah Utama Bakti Cemerlang (Distinguished Service Order) oleh Presiden Republik Singapura, Tuan Yang Terutama Tharman Shanmugaratnam dalam satu istiadat rasmi yang berlangsung di The Istana, Orchard Road, semalam.Pengurniaan darjah itu merupakan antara penghormatan tertinggi Kerajaan Singapura kepada tokoh luar negara yang telah menunjukkan komitmen luar biasa, khususnya pencapaian cemerlang Tan Sri Razarudin dalam memperkukuh kerjasama keselamatan serta hubungan dua hala antara Polis Diraja Malaysia dan Pasukan Polis Singapura (SPF).Sempena lawatan rasmi itu, Tan Sri Razarudin turut mengadakan kunjungan hormat ke atas Pemangku Pesuruhjaya Polis Singapura, DCP Lian Ghim Hua di Ibu Pejabat SPF, New Phoenix Park.Beliau bersama isteri yang juga Pengerusi Persatuan Keluarga Polis Malaysia, Puan Sri Datuk Zainah Othman turut menghadiri Majlis Makan Malam Rasmi yang berlangsung di Senior Police Officers Mess. Majlis turut dihadiri para pegawai kanan SPF.Mengakhiri lawatan rasmi ke negara tersebut, Tan Sri Razarudin telah mengadakan kunjungan hormat ke atas Perdana Menteri Singapura, H.E. Mr. Lawrence Wong yang berlangsung di The Istana, Orchard Road, pagi tadi.Hadir sama, bekas Ketua Urus Setia KPN (Perhubungan Antarabangsa) Bukit Aman, pesara SAC Dato Pahlawan Suparamaniam Ramasamy dan ACP Perhubungan Antarabangsa, ACP Loh Pey Pey.Sumber gambar: Singapore Police Force",
        "cleaned_caption": "KPN TERIMA DARJAH UTAMA BAKTI CEMERLANG DARIPADA PRESIDEN REPUBLIK SINGAPURA\n\nSingapura, 12 Jun 2025 Ketua Polis Negara (KPN), IG telah dikurniakan Darjah Utama Bakti Cemerlang (Distinguished Service Order) oleh Presiden Republik Singapura dalam satu istiadat rasmi yang berlangsung di The Istana, Orchard Road, semalam. Pengurniaan darjah itu merupakan antara penghormatan tertinggi Kerajaan Singapura kepada tokoh luar negara yang telah menunjukkan komitmen luar biasa, khususnya pencapaian cemerlang dalam memperkukuh kerjasama keselamatan serta hubungan dua hala antara Polis Diraja Malaysia dan Pasukan Polis Singapura (SPF).\n\nSempena lawatan rasmi itu, turut mengadakan kunjungan hormat ke atas Pemangku Pesuruhjaya Polis Singapura di Ibu Pejabat SPF, New Phoenix Park. Beliau bersama isteri yang juga Pengerusi Persatuan Keluarga Polis Malaysia turut menghadiri Majlis Makan Malam Rasmi yang berlangsung di Senior Police Officers Mess. Majlis turut dihadiri para pegawai kanan SPF.\n\nMengakhiri lawatan rasmi ke negara tersebut, telah mengadakan kunjungan hormat ke atas Perdana Menteri Singapura yang berlangsung di The Istana, Orchard Road, pagi tadi. Hadir sama, bekas Ketua Urus Setia KPN (Perhubungan Antarabangsa) Bukit Aman, pesara dan ACP Perhubungan Antarabangsa. \n\nSumber gambar: Singapore Police Force",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the significance of the Distinguished Service Order awarded to the Chief of Police in the image?\n",
        "question_and_answers": {
            "question_0": "What is the significance of the Distinguished Service Order awarded to the Chief of Police in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_103.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_103.jpg",
        "caption": "Behind the Scenes of GE2025: First In, Last Out - The Police Logistics DepartmentOfficers from the Police Logistics Department (PLD) provide critical and vital support to every major security deployment of the Singapore Police Force. They are often the first to be on site to put up the required security infrastructures, and last to leave to ensure that the venue is returned to its original state after a deployment. In between, they work tirelessly to coordinate between the units, HTX and contract partners to ensure all planned and the numerous additional support requests that surface during implementation are executed successfully. ASP Fabian Tan and his colleagues, ASP Kenneth Teo and Mr Norhalim Nordin and are some of the unsung heroes toiling behind the scenes, providing the essential logistical support to their frontline colleagues for GE2025. Their efforts ensure that operations can run smoothly and that officers can perform their duties effectively and efficiently. GE2025 singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "Behind the Scenes of GE2025: First In, Last Out - The Police Logistics Department. Officers from the Police Logistics Department (PLD) provide critical and vital support to every major security deployment of the Singapore Police Force. They are often the first to be on site to put up the required security infrastructures, and last to leave to ensure that the venue is returned to its original state after a deployment. In between, they work tirelessly to coordinate between the units, HTX and contract partners to ensure all planned and the numerous additional support requests that surface during implementation are executed successfully. Some of the unsung heroes toiling behind the scenes, providing the essential logistical support to their frontline colleagues for GE2025. Their efforts ensure that operations can run smoothly and that officers can perform their duties effectively and efficiently. GE2025 #singaporepoliceforce #safeguingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What are the roles of the two individuals in the image, and how do they contribute to the operations of the Police Logistics Department?\n",
        "question_and_answers": {
            "question_0": "What are the roles of the two individuals in the image, and how do they contribute to the operations of the Police Logistics Department?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_107.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_107.jpg",
        "caption": ": The Police Elections Permit Office (PEPO) is an office within the Singapore Police Force, activated during election periods to process and manage permits for election-related activities.For Eunice, a first-time PEPO member and SPF Civilian Officer, the experience has been eye-opening! Its amazing to see how everything comes together in supporting the General Election everyones role is crucial in making the election process seamless.Eunice and her colleagues, Shinq Chyuan and Saravanan Baba from PEPO play an important role in upholding the orderliness of the electoral process. GE2025 singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "The Police Elections Permit Office (PEPO) is an office within the Singapore Police Force, activated during election periods to process and manage permits for election-related activities. For a first-time PEPO member and SPF Civilian Officer, the experience has been eye-opening! It's amazing to see how everything comes together in supporting the General Election; everyone's role is crucial in making the election process seamless. The colleagues from PEPO play an important role in upholding the orderliness of the electoral process. GE2025 #singaporepoliceforce #safeguidingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the purpose of the Command Post as indicated in the sign?\n",
        "question_and_answers": {
            "question_0": "What is the purpose of the Command Post as indicated in the sign?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_132.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_132.jpg",
        "caption": "- The Singapore Police Force (SPF) conducted a counter-terrorism and emergency preparedness exercise at the Singapore Sports Hub on 15 April 2025. The exercise was organised by the SPF, supported by the Singapore Civil Defence Force and the Singapore Armed Forces, in close collaboration with Kallang Alive Sport Management. Ms Sun Xueling, Minister of State, Ministry of Home Affairs & Ministry of Social and Family Development, attended as the Guest-of-Honour. With more large-scale concerts and lifestyle events held at the Singapore Sports Hub, this exercise strengthens emergency preparedness against potential terror threats in diverse urban environments. In this exercise, the SPF demonstrated how post-blast investigations are conducted, where forensic examination of improvised explosive devices (IED) fragments at a post-blast scene can provide useful investigative leads on the structure and construction of the IED. Every member of the community has a role to play in keeping Singapore safe against terrorism by remaining vigilant at all times. The communitys timely action can help prevent catastrophic outcomes, save lives and keep our home safe. For more information on how you can help keep our home safe from terrorism, please visit the Instagram or SGSecure website ( Photos by: SC Javier Tay",
        "cleaned_caption": "The Singapore Police Force (SPF) conducted a counter-terrorism and emergency preparedness exercise at the Singapore Sports Hub on 15 April 2025. The exercise was organised by the SPF, supported by the Singapore Civil Defence Force and the Singapore Armed Forces, in close collaboration with Kallang Alive Sport Management. The Minister of State, Ministry of Home Affairs & Ministry of Social and Family Development, attended as the Guest-of-Honour. With more large-scale concerts and lifestyle events held at the Singapore Sports Hub, this exercise strengthens emergency preparedness against potential terror threats in diverse urban environments. In this exercise, the SPF demonstrated how post-blast investigations are conducted, where forensic examination of improvised explosive devices (IED) fragments at a post-blast scene can provide useful investigative leads on the structure and construction of the IED. Every member of the community has a role to play in keeping Singapore safe against terrorism by remaining vigilant at all times. The community's timely action can help prevent catastrophic outcomes, save lives and keep our home safe.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What type of vehicle is prominently featured in this scene?\n",
        "question_and_answers": {
            "question_0": "What type of vehicle is prominently featured in this scene?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_135.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_135.jpg",
        "caption": "On 4th April 2025, we were honoured to host Prime Minister Lawrence Wong at Punggol Neighbourhood Police Centre and Punggol Fire Station During the visit, our officers showcased the latest operational capabilities. PM Wong witnessed hands-on demonstrations including SPFs Counter-Drone Capability and Next-generation Fast Response Car and SCDFs Smart Classroom with Virtual Reality and Extended Reality training systems, High-Performance Cardiopulmonary Resuscitation and the Electric Pump Ladder. PM also had engagements with our Home Team National Servicemen (NSmen), who are part of more than 50,000 operationally ready NSmen and Full-time National Servicemen. They have all played a crucial role in keeping Singapore safe and secure over the past decades. This year also marks 50 years of Police National Service for SPF.We thank PM Wong for taking the time to visit us! OneHomeTeam safegaurdingeveryday thelifesavingforce",
        "cleaned_caption": "On 4th April 2025, we were honoured to host Prime Minister at Punggol Neighbourhood Police Centre and Punggol Fire Station. During the visit, our officers showcased the latest operational capabilities. The Prime Minister witnessed hands-on demonstrations including SPF's Counter-Drone Capability, Next-generation Fast Response Car, and SCDF's Smart Classroom with Virtual Reality and Extended Reality training systems, High-Performance Cardiopulmonary Resuscitation, and the Electric Pump Ladder. The Prime Minister also had engagements with our Home Team National Servicemen (NSmen), who are part of more than 50,000 operationally ready NSmen and Full-time National Servicemen. They have all played a crucial role in keeping Singapore safe and secure over the past decades. This year also marks 50 years of Police National Service for SPF. We thank the Prime Minister for taking the time to visit us! OneHomeTeam safegaurdingeveryday thelifesavingforce",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the purpose of the equipment used for emergency response seen in the image?\n",
        "question_and_answers": {
            "question_0": "What is the purpose of the equipment used for emergency response seen in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_155.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_155.jpg",
        "caption": "International Partnerships in ActionThe Singapore Police Forces (SPF) Special Operations Group (SOG) hosted 19 ATLAS officers at the Home Team Tactical Centre (HTTC) between 11 and 13 March 2025, marking a significant milestone in international tactical unit collaboration. The ATLAS Network connects the European Unions Special Intervention Units, facilitating the exchange of experiences and best practices in counter-terrorism.During the forum, the ATLAS participants experienced HTTCs comprehensive training facilities through focused discussions and demonstrations on the latest counter-terrorism tactics. The theme of discussion centred on the use of technology in different domains such as breaching, low-light close quarter battle and the use of drones.Through international collaboration and learning, the SPF remains dedicated to elevating our officers tactical excellence.singaporepoliceforce safeguardingeveryday specialoperationsgroup ATLAS",
        "cleaned_caption": "International Partnerships in Action. The Singapore Police Forces (SPF) Special Operations Group (SOG) hosted 19 ATLAS officers at the Home Team Tactical Centre (HTTC) between 11 and 13 March 2025, marking a significant milestone in international tactical unit collaboration. The ATLAS Network connects the European Union's Special Intervention Units, facilitating the exchange of experiences and best practices in counter-terrorism. During the forum, the ATLAS participants experienced HTTC's comprehensive training facilities through focused discussions and demonstrations on the latest counter-terrorism tactics. The theme of discussion centred on the use of technology in different domains such as breaching, low-light close quarter battle and the use of drones. Through international collaboration and learning, the SPF remains dedicated to elevating our officers' tactical excellence.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What type of training exercise is being conducted in this image?\n",
        "question_and_answers": {
            "question_0": "What type of training exercise is being conducted in this image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_159.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_159.jpg",
        "caption": "International Partnerships in ActionThe Singapore Police Forces (SPF) Special Operations Group (SOG) hosted 19 ATLAS officers at the Home Team Tactical Centre (HTTC) between 11 and 13 March 2025, marking a significant milestone in international tactical unit collaboration. The ATLAS Network connects the European Unions Special Intervention Units, facilitating the exchange of experiences and best practices in counter-terrorism.During the forum, the ATLAS participants experienced HTTCs comprehensive training facilities through focused discussions and demonstrations on the latest counter-terrorism tactics. The theme of discussion centred on the use of technology in different domains such as breaching, low-light close quarter battle and the use of drones.Through international collaboration and learning, the SPF remains dedicated to elevating our officers tactical excellence.singaporepoliceforce safeguardingeveryday specialoperationsgroup ATLAS",
        "cleaned_caption": "International Partnerships in Action The Singapore Police Force (SPF) Special Operations Group (SOG) hosted 19 ATLAS officers at the Home Team Tactical Centre (HTTC) between 11 and 13 March 2025, marking a significant milestone in international tactical unit collaboration. The ATLAS Network connects the European Union's Special Intervention Units, facilitating the exchange of experiences and best practices in counter-terrorism. During the forum, the ATLAS participants experienced HTTC's comprehensive training facilities through focused discussions and demonstrations on the latest counter-terrorism tactics. The theme of discussion centred on the use of technology in different domains such as breaching, low-light close quarter battle and the use of drones. Through international collaboration and learning, the SPF remains dedicated to elevating our officers' tactical excellence.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is happening at the doorway in the image?\n",
        "question_and_answers": {
            "question_0": "What is happening at the doorway in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_217.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_217.jpg",
        "caption": "[ , ! ] Through , a nonprofit organisation that grants wishes of children who are battling critical illnesses, we are honoured to be part of Elis wish journey. Eli, who has always wanted to be a police officer, suited up in his own mini police uniform, explored the equipment and vehicle, tried collecting forensic evidence and even joined our officers on neighbourhood patrol to share scam prevention tips with members of the public! His bravery and positivity are truly insipring. Wishing you all the happiness in the world, little officer Eli! MakeAWish SingaporePoliceForce DreamComeTrue Inspiration",
        "cleaned_caption": "Through a nonprofit organisation that grants wishes of children who are battling critical illnesses, we are honoured to be part of a wish journey. A young boy, who has always wanted to be a police officer, suited up in his own mini police uniform, explored the equipment and vehicle, tried collecting forensic evidence and even joined our officers on neighbourhood patrol to share scam prevention tips with members of the public! His bravery and positivity are truly inspiring. Wishing you all the happiness in the world, little officer! MakeAWish SingaporePoliceForce DreamComeTrue Inspiration",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What kind of attire is the young boy wearing in the image?\n",
        "question_and_answers": {
            "question_0": "What kind of attire is the young boy wearing in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_222.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_222.jpg",
        "caption": "The Singapore Police Force (SPF) held a graduation parade for 66 Regular Police Officers and 340 Full-Time Police National Service Officers from the 197th Intake on 13 January 2025. This parade signifies the completion of their Police Officer Basic Course at the Police Training Command.Mr Vikram Nair, Member of the Government Parliamentary Committee for Home Affairs & Law, graced the parade as the Reviewing Officer.During his speech, Mr Vikram Nair commended the overseas-based Full-Time Police National Service Officer graduands who dutifully returned to serve their National Service to protect and serve the nation. Together with regular officers, they underwent a tough and realistic training programme to instil confidence when deployed operationally. Mr Vikram Nair reiterated to the graduating cohort that they are entrusted with the heavy responsibility of their mission, which is to prevent, deter and detect crime to ensure a safe and secure Singapore. He congratulated the graduating officers on completing their basic training and encouraged them to take pride in performing their duties to safeguard Singapore every day.Mr Vikram Nair also thanked the parents and friends who were present for their unwavering support during the officers training journey.Congratulations and well done to the graduating cohort!",
        "cleaned_caption": "The Singapore Police Force (SPF) held a graduation parade for 66 Regular Police Officers and 340 Full-Time Police National Service Officers from the 197th Intake on 13 January 2025. This parade signifies the completion of their Police Officer Basic Course at the Police Training Command. The Member of the Government Parliamentary Committee for Home Affairs & Law graced the parade as the Reviewing Officer. During his speech, he commended the overseas-based Full-Time Police National Service Officer graduands who dutifully returned to serve their National Service to protect and serve the nation. Together with regular officers, they underwent a tough and realistic training programme to instil confidence when deployed operationally. He reiterated to the graduating cohort that they are entrusted with the heavy responsibility of their mission, which is to prevent, deter and detect crime to ensure a safe and secure Singapore. He congratulated the graduating officers on completing their basic training and encouraged them to take pride in performing their duties to safeguard Singapore every day. He also thanked the parents and friends who were present for their unwavering support during the officers' training journey. Congratulations and well done to the graduating cohort!",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What event is taking place at the podium in the image?\n",
        "question_and_answers": {
            "question_0": "What event is taking place at the podium in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_223.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_223.jpg",
        "caption": "The Singapore Police Force (SPF) held a graduation parade for 66 Regular Police Officers and 340 Full-Time Police National Service Officers from the 197th Intake on 13 January 2025. This parade signifies the completion of their Police Officer Basic Course at the Police Training Command.Mr Vikram Nair, Member of the Government Parliamentary Committee for Home Affairs & Law, graced the parade as the Reviewing Officer.During his speech, Mr Vikram Nair commended the overseas-based Full-Time Police National Service Officer graduands who dutifully returned to serve their National Service to protect and serve the nation. Together with regular officers, they underwent a tough and realistic training programme to instil confidence when deployed operationally. Mr Vikram Nair reiterated to the graduating cohort that they are entrusted with the heavy responsibility of their mission, which is to prevent, deter and detect crime to ensure a safe and secure Singapore. He congratulated the graduating officers on completing their basic training and encouraged them to take pride in performing their duties to safeguard Singapore every day.Mr Vikram Nair also thanked the parents and friends who were present for their unwavering support during the officers training journey.Congratulations and well done to the graduating cohort!",
        "cleaned_caption": "The Singapore Police Force (SPF) held a graduation parade for 66 Regular Police Officers and 340 Full-Time Police National Service Officers from the 197th Intake on 13 January 2025. This parade signifies the completion of their Police Officer Basic Course at the Police Training Command. The Member of the Government Parliamentary Committee for Home Affairs & Law graced the parade as the Reviewing Officer. During the speech, it was commended that the overseas-based Full-Time Police National Service Officer graduands dutifully returned to serve their National Service to protect and serve the nation. Together with regular officers, they underwent a tough and realistic training programme to instil confidence when deployed operationally. It was reiterated to the graduating cohort that they are entrusted with the heavy responsibility of their mission, which is to prevent, deter and detect crime to ensure a safe and secure Singapore. Congratulations were extended to the graduating officers on completing their basic training and encouragement was given to take pride in performing their duties to safeguard Singapore every day. Thanks were also given to the parents and friends who were present for their unwavering support during the officers' training journey. Congratulations and well done to the graduating cohort!",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What award is the police officer receiving in the image?\n",
        "question_and_answers": {
            "question_0": "What award is the police officer receiving in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_224.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_224.jpg",
        "caption": "The Singapore Police Force (SPF) held a graduation parade for 66 Regular Police Officers and 340 Full-Time Police National Service Officers from the 197th Intake on 13 January 2025. This parade signifies the completion of their Police Officer Basic Course at the Police Training Command.Mr Vikram Nair, Member of the Government Parliamentary Committee for Home Affairs & Law, graced the parade as the Reviewing Officer.During his speech, Mr Vikram Nair commended the overseas-based Full-Time Police National Service Officer graduands who dutifully returned to serve their National Service to protect and serve the nation. Together with regular officers, they underwent a tough and realistic training programme to instil confidence when deployed operationally. Mr Vikram Nair reiterated to the graduating cohort that they are entrusted with the heavy responsibility of their mission, which is to prevent, deter and detect crime to ensure a safe and secure Singapore. He congratulated the graduating officers on completing their basic training and encouraged them to take pride in performing their duties to safeguard Singapore every day.Mr Vikram Nair also thanked the parents and friends who were present for their unwavering support during the officers training journey.Congratulations and well done to the graduating cohort!",
        "cleaned_caption": "The Singapore Police Force (SPF) held a graduation parade for 66 Regular Police Officers and 340 Full-Time Police National Service Officers from the 197th Intake on 13 January 2025. This parade signifies the completion of their Police Officer Basic Course at the Police Training Command. The Member of the Government Parliamentary Committee for Home Affairs & Law graced the parade as the Reviewing Officer. During the speech, it was commended that the overseas-based Full-Time Police National Service Officer graduands who dutifully returned to serve their National Service to protect and serve the nation. Together with regular officers, they underwent a tough and realistic training programme to instil confidence when deployed operationally. It was reiterated to the graduating cohort that they are entrusted with the heavy responsibility of their mission, which is to prevent, deter and detect crime to ensure a safe and secure Singapore. Congratulations were extended to the graduating officers on completing their basic training and encouragement was given to take pride in performing their duties to safeguard Singapore every day. Thanks were also given to the parents and friends who were present for their unwavering support during the officers' training journey. Congratulations and well done to the graduating cohort!",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What award is being presented in the image?\n",
        "question_and_answers": {
            "question_0": "What award is being presented in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_282.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_282.jpg",
        "caption": "Dato Paduka Seri Haji Mohammad Irwan Bin Haji Hambali, Commissioner of Police of the Royal Brunei Police Force, was conferred the Darjah Utama Bakti Cemerlang (Distinguished Service Order) by President Tharman Shanmugaratnam on 15 October 2024 at the Istana.CP Dato Mohammad Irwan was appointed Commissioner of Police of Royal Brunei Police Force on 22 June 2019. Under his leadership, the bilateral relationship between the Royal Brunei Police Force and the Singapore Police Force was strengthened, underpinnedby close cooperation in capacity and capability building. CP Dato Mohammad Irwan strongly supported mutual training exchanges between the two Police forces which helped hone the specialised skillsets of officers.This close cooperation reflects CP Dato Mohammad Irwans strong commitment to advancing bilateral ties between Brunei and Singapore and in turn, enhance the safety and security of both nations.The Singapore Police Force and Royal Brunei Police Force enjoy a longstanding partnership built on mutual trust and unwavering commitment to fighting crime. We will continue to strengthen this partnership and leverage our combined expertise to better safeguard our nations, said Commissioner of Police Hoong Wee Teck.During his stay in Singapore, CP Dato Mohammad Irwan made courtesy calls on Prime Minister and Minister for Finance Lawrence Wong and Commissioner of Police Hoong Wee Teck.",
        "cleaned_caption": "Commissioner of Police of the Royal Brunei Police Force was conferred the Darjah Utama Bakti Cemerlang (Distinguished Service Order) by President on 15 October 2024 at the Istana. The Commissioner was appointed Commissioner of Police of the Royal Brunei Police Force on 22 June 2019. Under his leadership, the bilateral relationship between the Royal Brunei Police Force and the Singapore Police Force was strengthened, underpinned by close cooperation in capacity and capability building. The Commissioner strongly supported mutual training exchanges between the two Police forces which helped hone the specialised skillsets of officers. This close cooperation reflects the Commissioner’s strong commitment to advancing bilateral ties between Brunei and Singapore and in turn, enhance the safety and security of both nations. The Singapore Police Force and Royal Brunei Police Force enjoy a longstanding partnership built on mutual trust and unwavering commitment to fighting crime. We will continue to strengthen this partnership and leverage our combined expertise to better safeguard our nations, said Commissioner of Police. During his stay in Singapore, the Commissioner made courtesy calls on Prime Minister and Minister for Finance and Commissioner of Police.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the event taking place in this image?\n",
        "question_and_answers": {
            "question_0": "What is the event taking place in this image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_285.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_285.jpg",
        "caption": ", , , On the morning of 16 September 2024, SI Aniq and SGT Fayyaz from Rochor NPC were at Block 7 North Bridge Road when they noticed a strong burning smell in the vicinity. SI Aniq conducted a visual scan from the exterior of the block and saw thick smoke emanating from a units kitchen window. Aniq alerted the SCDF immediately and called for back-up whilst running up the stairs to the unit to attend to the incident.Upon reaching the affected level, the common corridor was already engulfed in thick black smoke. Braving the smoke, Aniq and Fayyaz crouched down and rushed towards the unit. There, they saw an elderly man standing at the main gate, clutching his pants and t-shirt. He was trying to exit the unit, but the gate was locked and he was unsure where the key was.While SI Aniq and SGT Fayyaz were attempting to calm the man down and jog his memory on where the key was kept, SGT Tong and SC Armand arrived and assisted to quickly evacuate occupants of the neighbouring units to safety.During the engagement, the man suddenly threw two pairs of pants and a shirt out of the unit. Wasting no time, SGT Fayyaz searched the pants for the key and in a slightly burnt pants pocket, SGT Fayyaz found it. Officers quickly opened the gate and brought the man to safety. By this time, the black smoke had thickened and started to irritate the eyes of the officers. In spite of that, two officers rushed into the unit and put out the fire with an extinguisher. The man was subsequently conveyed to hospital for treatment of his burn injuries. At that moment, all we wanted to do is to save the man and evacuate his neighbours to safety. Looking back, our safety were likely at risk too because the smoke was getting thicker by the minute. But I am glad everyone was safe, including the man. If I had a choice, I would still have stuck with my decision to stay put to save a life, said SI Aniq.singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "On the morning of 16 September 2024, officers from Rochor NPC were at Block 7 North Bridge Road when they noticed a strong burning smell in the vicinity. One officer conducted a visual scan from the exterior of the block and saw thick smoke emanating from a unit's kitchen window. The officer alerted the SCDF immediately and called for back-up whilst running up the stairs to the unit to attend to the incident. Upon reaching the affected level, the common corridor was already engulfed in thick black smoke. Braving the smoke, the officers crouched down and rushed towards the unit. There, they saw an elderly man standing at the main gate, clutching his pants and t-shirt. He was trying to exit the unit, but the gate was locked and he was unsure where the key was. While the officers were attempting to calm the man down and jog his memory on where the key was kept, additional officers arrived and assisted to quickly evacuate occupants of the neighbouring units to safety. During the engagement, the man suddenly threw two pairs of pants and a shirt out of the unit. Wasting no time, one officer searched the pants for the key and in a slightly burnt pants pocket, found it. The officers quickly opened the gate and brought the man to safety. By this time, the black smoke had thickened and started to irritate the eyes of the officers. In spite of that, two officers rushed into the unit and put out the fire with an extinguisher. The man was subsequently conveyed to hospital for treatment of his burn injuries. At that moment, all the officers wanted to do was to save the man and evacuate his neighbours to safety. Looking back, their safety was likely at risk too because the smoke was getting thicker by the minute. But they are glad everyone was safe, including the man. If they had a choice, they would still have stuck with their decision to stay put to save a life. #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What are the uniforms worn by the officers in the image?\n",
        "question_and_answers": {
            "question_0": "What are the uniforms worn by the officers in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_286.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_286.jpg",
        "caption": ", , , On the morning of 16 September 2024, SI Aniq and SGT Fayyaz from Rochor NPC were at Block 7 North Bridge Road when they noticed a strong burning smell in the vicinity. SI Aniq conducted a visual scan from the exterior of the block and saw thick smoke emanating from a units kitchen window. Aniq alerted the SCDF immediately and called for back-up whilst running up the stairs to the unit to attend to the incident.Upon reaching the affected level, the common corridor was already engulfed in thick black smoke. Braving the smoke, Aniq and Fayyaz crouched down and rushed towards the unit. There, they saw an elderly man standing at the main gate, clutching his pants and t-shirt. He was trying to exit the unit, but the gate was locked and he was unsure where the key was.While SI Aniq and SGT Fayyaz were attempting to calm the man down and jog his memory on where the key was kept, SGT Tong and SC Armand arrived and assisted to quickly evacuate occupants of the neighbouring units to safety.During the engagement, the man suddenly threw two pairs of pants and a shirt out of the unit. Wasting no time, SGT Fayyaz searched the pants for the key and in a slightly burnt pants pocket, SGT Fayyaz found it. Officers quickly opened the gate and brought the man to safety. By this time, the black smoke had thickened and started to irritate the eyes of the officers. In spite of that, two officers rushed into the unit and put out the fire with an extinguisher. The man was subsequently conveyed to hospital for treatment of his burn injuries. At that moment, all we wanted to do is to save the man and evacuate his neighbours to safety. Looking back, our safety were likely at risk too because the smoke was getting thicker by the minute. But I am glad everyone was safe, including the man. If I had a choice, I would still have stuck with my decision to stay put to save a life, said SI Aniq.singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "On the morning of 16 September 2024, officers from Rochor NPC were at Block 7 North Bridge Road when they noticed a strong burning smell in the vicinity. An officer conducted a visual scan from the exterior of the block and saw thick smoke emanating from a unit's kitchen window. The officer alerted the SCDF immediately and called for back-up whilst running up the stairs to the unit to attend to the incident. Upon reaching the affected level, the common corridor was already engulfed in thick black smoke. Braving the smoke, the officers crouched down and rushed towards the unit. There, they saw an elderly man standing at the main gate, clutching his pants and t-shirt. He was trying to exit the unit, but the gate was locked and he was unsure where the key was. While the officers were attempting to calm the man down and jog his memory on where the key was kept, additional officers arrived and assisted to quickly evacuate occupants of the neighbouring units to safety. During the engagement, the man suddenly threw two pairs of pants and a shirt out of the unit. Wasting no time, one officer searched the pants for the key and in a slightly burnt pants pocket, found it. Officers quickly opened the gate and brought the man to safety. By this time, the black smoke had thickened and started to irritate the eyes of the officers. In spite of that, two officers rushed into the unit and put out the fire with an extinguisher. The man was subsequently conveyed to hospital for treatment of his burn injuries. At that moment, the priority was to save the man and evacuate his neighbours to safety. Looking back, their safety was likely at risk too because the smoke was getting thicker by the minute. But there was satisfaction in knowing everyone was safe, including the man. If there had been a choice, the decision to stay put to save a life would still have been made.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the source of the smoke visible from the window?\n",
        "question_and_answers": {
            "question_0": "What is the source of the smoke visible from the window?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_290.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_290.jpg",
        "caption": ", , , On the morning of 16 September 2024, SI Aniq and SGT Fayyaz from Rochor NPC were at Block 7 North Bridge Road when they noticed a strong burning smell in the vicinity. SI Aniq conducted a visual scan from the exterior of the block and saw thick smoke emanating from a units kitchen window. Aniq alerted the SCDF immediately and called for back-up whilst running up the stairs to the unit to attend to the incident.Upon reaching the affected level, the common corridor was already engulfed in thick black smoke. Braving the smoke, Aniq and Fayyaz crouched down and rushed towards the unit. There, they saw an elderly man standing at the main gate, clutching his pants and t-shirt. He was trying to exit the unit, but the gate was locked and he was unsure where the key was.While SI Aniq and SGT Fayyaz were attempting to calm the man down and jog his memory on where the key was kept, SGT Tong and SC Armand arrived and assisted to quickly evacuate occupants of the neighbouring units to safety.During the engagement, the man suddenly threw two pairs of pants and a shirt out of the unit. Wasting no time, SGT Fayyaz searched the pants for the key and in a slightly burnt pants pocket, SGT Fayyaz found it. Officers quickly opened the gate and brought the man to safety. By this time, the black smoke had thickened and started to irritate the eyes of the officers. In spite of that, two officers rushed into the unit and put out the fire with an extinguisher. The man was subsequently conveyed to hospital for treatment of his burn injuries. At that moment, all we wanted to do is to save the man and evacuate his neighbours to safety. Looking back, our safety were likely at risk too because the smoke was getting thicker by the minute. But I am glad everyone was safe, including the man. If I had a choice, I would still have stuck with my decision to stay put to save a life, said SI Aniq.singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "On the morning of 16 September 2024, officers from Rochor NPC were at Block 7 North Bridge Road when they noticed a strong burning smell in the vicinity. An officer conducted a visual scan from the exterior of the block and saw thick smoke emanating from a unit's kitchen window. The officer alerted the SCDF immediately and called for back-up while running up the stairs to the unit to attend to the incident. Upon reaching the affected level, the common corridor was already engulfed in thick black smoke. Braving the smoke, the officers crouched down and rushed towards the unit. There, they saw an elderly man standing at the main gate, clutching his pants and t-shirt. He was trying to exit the unit, but the gate was locked and he was unsure where the key was. While the officers were attempting to calm the man down and jog his memory on where the key was kept, additional officers arrived and assisted to quickly evacuate occupants of the neighbouring units to safety. During the engagement, the man suddenly threw two pairs of pants and a shirt out of the unit. Wasting no time, one officer searched the pants for the key and in a slightly burnt pants pocket, found it. Officers quickly opened the gate and brought the man to safety. By this time, the black smoke had thickened and started to irritate the eyes of the officers. In spite of that, two officers rushed into the unit and put out the fire with an extinguisher. The man was subsequently conveyed to hospital for treatment of his burn injuries. At that moment, all we wanted to do was to save the man and evacuate his neighbours to safety. Looking back, our safety was likely at risk too because the smoke was getting thicker by the minute. But I am glad everyone was safe, including the man. If I had a choice, I would still have stuck with my decision to stay put to save a life, said the officer. #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the object that the person is holding in the image?\n",
        "question_and_answers": {
            "question_0": "What is the object that the person is holding in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_291.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_291.jpg",
        "caption": ", , , On the morning of 16 September 2024, SI Aniq and SGT Fayyaz from Rochor NPC were at Block 7 North Bridge Road when they noticed a strong burning smell in the vicinity. SI Aniq conducted a visual scan from the exterior of the block and saw thick smoke emanating from a units kitchen window. Aniq alerted the SCDF immediately and called for back-up whilst running up the stairs to the unit to attend to the incident.Upon reaching the affected level, the common corridor was already engulfed in thick black smoke. Braving the smoke, Aniq and Fayyaz crouched down and rushed towards the unit. There, they saw an elderly man standing at the main gate, clutching his pants and t-shirt. He was trying to exit the unit, but the gate was locked and he was unsure where the key was.While SI Aniq and SGT Fayyaz were attempting to calm the man down and jog his memory on where the key was kept, SGT Tong and SC Armand arrived and assisted to quickly evacuate occupants of the neighbouring units to safety.During the engagement, the man suddenly threw two pairs of pants and a shirt out of the unit. Wasting no time, SGT Fayyaz searched the pants for the key and in a slightly burnt pants pocket, SGT Fayyaz found it. Officers quickly opened the gate and brought the man to safety. By this time, the black smoke had thickened and started to irritate the eyes of the officers. In spite of that, two officers rushed into the unit and put out the fire with an extinguisher. The man was subsequently conveyed to hospital for treatment of his burn injuries. At that moment, all we wanted to do is to save the man and evacuate his neighbours to safety. Looking back, our safety were likely at risk too because the smoke was getting thicker by the minute. But I am glad everyone was safe, including the man. If I had a choice, I would still have stuck with my decision to stay put to save a life, said SI Aniq.singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "On the morning of 16 September 2024, SI and SGT from Rochor NPC were at Block 7 North Bridge Road when they noticed a strong burning smell in the vicinity. SI conducted a visual scan from the exterior of the block and saw thick smoke emanating from a unit's kitchen window. SI alerted the SCDF immediately and called for back-up whilst running up the stairs to the unit to attend to the incident. Upon reaching the affected level, the common corridor was already engulfed in thick black smoke. Braving the smoke, SI and SGT crouched down and rushed towards the unit. There, they saw an elderly man standing at the main gate, clutching his pants and t-shirt. He was trying to exit the unit, but the gate was locked and he was unsure where the key was. While SI and SGT were attempting to calm the man down and jog his memory on where the key was kept, SGT and SC arrived and assisted to quickly evacuate occupants of the neighbouring units to safety. During the engagement, the man suddenly threw two pairs of pants and a shirt out of the unit. Wasting no time, SGT searched the pants for the key and in a slightly burnt pants pocket, SGT found it. Officers quickly opened the gate and brought the man to safety. By this time, the black smoke had thickened and started to irritate the eyes of the officers. In spite of that, two officers rushed into the unit and put out the fire with an extinguisher. The man was subsequently conveyed to hospital for treatment of his burn injuries. At that moment, all we wanted to do is to save the man and evacuate his neighbours to safety. Looking back, our safety was likely at risk too because the smoke was getting thicker by the minute. But I am glad everyone was safe, including the man. If I had a choice, I would still have stuck with my decision to stay put to save a life, said SI.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the setting captured in the image?\n",
        "question_and_answers": {
            "question_0": "What is the setting captured in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_347.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_347.jpg",
        "caption": "Deputy Superintendent of Police (DSP) Jeremy Png is a Course Manager at the Police Training Command. As a course manager, DSP Jeremy trains and nurtures the next generation of police officers and leaders, imparting them with the essential skills, knowledge, and values for them to succeed as competent officers.In the little pockets of time DSP Jeremy has while on leave or on weekends, he dresses up as a clown to tell stories and perform magic tricks to children warded in the hospital to distract them from the hospital procedures and help them deal with the range of emotions they may experience. He also visits nursing homes to entertain and interact with the residents, helping to keep their spirits high.I have always had a strong passion for helping people, especially the weak and the vulnerable. That is why I became a police officer in 1991 and why I decided to volunteer. There are people amongst us going through tough times and I hope my presence, even if momentarily, can help distract them from their pain, discomfort or problems.There is one line within the Police Pledge which says, we pledge to serve our community and our country and I think this line resonates with me. I am happy to be able to make small differences to the lives of others through volunteering, while continuing to make meaningful contributions to our country in my job as a police officer. Read more about DSP Jeremys volunteering journey via the link in our bio.Photos 3 & 4 credit: PSD Challenge",
        "cleaned_caption": "Deputy Superintendent of Police (DSP) is a Course Manager at the Police Training Command. As a course manager, DSP trains and nurtures the next generation of police officers and leaders, imparting them with the essential skills, knowledge, and values for them to succeed as competent officers. In the little pockets of time DSP has while on leave or on weekends, he dresses up as a clown to tell stories and perform magic tricks to children warded in the hospital to distract them from the hospital procedures and help them deal with the range of emotions they may experience. He also visits nursing homes to entertain and interact with the residents, helping to keep their spirits high. There are people amongst us going through tough times and I hope my presence, even if momentarily, can help distract them from their pain, discomfort or problems. There is one line within the Police Pledge which says, we pledge to serve our community and our country and I think this line resonates with me. I am happy to be able to make small differences to the lives of others through volunteering, while continuing to make meaningful contributions to our country in my job as a police officer. Read more about DSP's volunteering journey via the link in our bio. Photos 3 & 4 credit: PSD Challenge",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What kind of animal is being held by the person in the image?\n",
        "question_and_answers": {
            "question_0": "What kind of animal is being held by the person in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_358.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_358.jpg",
        "caption": "The SPF Band represented Singapore on a global stage at the Basel Tattoo in Switzerland. Being the only band from Asia in attendance this year, the SPF Combined Band, comprising the SPF Band, the Women Police Pipes and Drums as well as the Gurkha Contingent Pipes and Drums Platoon showcased Singaporean culture to the spectators of the Basel tattoo. Titled the Tapestry of Temasek, the performance led by Director of Music SUPT Sulaiman Abdul Wahab features traditional elements and dances from Indian, Malay, Eurasian and Chinese cultures including a lion dance segment performed entirely by SPF officers. Promoting the Singaporean culture on a global stage, the performances spread across 2 weeks have been met with praise and standing ovations from local and foreign crowds.The SPF Band also performed alongside musicians from across the world such as the Australian Army Band, the US Army Field Band and the Swiss Armed Forces Brass Band in combined segments that highlighted collaboration between countries from around the world.",
        "cleaned_caption": "The SPF Band represented Singapore on a global stage at the Basel Tattoo in Switzerland. Being the only band from Asia in attendance this year, the SPF Combined Band, comprising the SPF Band, the Women Police Pipes and Drums as well as the Gurkha Contingent Pipes and Drums Platoon showcased Singaporean culture to the spectators of the Basel Tattoo. Titled the Tapestry of Temasek, the performance led by Director of Music features traditional elements and dances from Indian, Malay, Eurasian, and Chinese cultures including a lion dance segment performed entirely by SPF officers. Promoting Singaporean culture on a global stage, the performances spread across 2 weeks have been met with praise and standing ovations from local and foreign crowds. The SPF Band also performed alongside musicians from across the world such as the Australian Army Band, the US Army Field Band, and the Swiss Armed Forces Brass Band in combined segments that highlighted collaboration between countries from around the world.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What type of performance is taking place on the stage in the image?\n",
        "question_and_answers": {
            "question_0": "What type of performance is taking place on the stage in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_369.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_369.jpg",
        "caption": ": ()Meet ASP Candy, the first female officer who has successfully completed the Police Tactical Course in the Special Operations Command!The Police Tactical Course was designed to be mentally and physically challenging to help hone trainees skills and tactics in dealing with public order and public security threats. It is one of the more physically gruelling courses, even for male officers.As women, our physical build is naturally different from the men. Despite how others may view it as an additional hurdle I had to overcome, I harnessed it as a strength instead, allowing it to push me to discover new ways to navigate these challenges. Our body and mind are capable of limitless potential and if you are determined to do something, you can achieve it. And yes, I certainly do hope to see more female PTU officers joining me in the years to come! (laughs) ASP CandySPFInFocus singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "Meet ASP, the first female officer who has successfully completed the Police Tactical Course in the Special Operations Command! The Police Tactical Course was designed to be mentally and physically challenging to help hone trainees' skills and tactics in dealing with public order and public security threats. It is one of the more physically grueling courses, even for male officers. As women, our physical build is naturally different from the men. Despite how others may view it as an additional hurdle I had to overcome, I harnessed it as a strength instead, allowing it to push me to discover new ways to navigate these challenges. Our body and mind are capable of limitless potential and if you are determined to do something, you can achieve it. And yes, I certainly do hope to see more female PTU officers joining me in the years to come! (laughs)",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What type of tactical gear are the officers wearing in the image?\n",
        "question_and_answers": {
            "question_0": "What type of tactical gear are the officers wearing in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_376.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_376.jpg",
        "caption": "() , Clementi Police Division has clinched the Best Land Division award three times in a row at the Police Day Parade held at the Home Team Academy on 3 June 2024.One officer who has witnessed it all is veteran Supt Lim Sin Kim, Head Logistics and Finance in Clementi Police Division. This is not surprising, given that he has spent more than 25 years in the Division, serving 10 different commanders.Supt Lim joined the Singapore Police Force (SPF) as a Police Constable in February 1985 and began his career as a patrol team officer. He also had postings in the investigation and operation domains in his 39 years with the SPF. He has risen through the ranks over the years, and is now a Superintendent of Police, responsible for managing the finance and logistics aspects in the Division.When I first joined the SPF in the 1980s, the patrol car was pretty much just a normal car with a police logo on it. On the interior, it looks like any other car on the road. Today, our next-generation fast response car integrates technology and functional design, which greatly improves our officers operational effectiveness and safety at the frontline.Also gone were the days where we need to do photo-fit to get a rough idea of how our suspects look like! Today, our police cameras are able to provide useful leads quickly to help us solve cases.And of course, as the society progresses, actions by the police on the ground will sometimes get scrutinised by the public. It is a challenge that we have to deal with, and I always share with my officers that as long as we remain professional and stay true to our core values in every case we handle, we will be fine.(Continued in comments)",
        "cleaned_caption": "Clementi Police Division has clinched the Best Land Division award three times in a row at the Police Day Parade held at the Home Team Academy on 3 June 2024. One officer who has witnessed it all is veteran Supt, Head Logistics and Finance in Clementi Police Division. This is not surprising, given that he has spent more than 25 years in the Division, serving 10 different commanders. Supt joined the Singapore Police Force (SPF) as a Police Constable in February 1985 and began his career as a patrol team officer. He also had postings in the investigation and operation domains in his 39 years with the SPF. He has risen through the ranks over the years and is now a Superintendent of Police, responsible for managing the finance and logistics aspects in the Division. When I first joined the SPF in the 1980s, the patrol car was pretty much just a normal car with a police logo on it. On the interior, it looks like any other car on the road. Today, our next-generation fast response car integrates technology and functional design, which greatly improves our officers' operational effectiveness and safety at the frontline. Also gone were the days where we need to do photo-fit to get a rough idea of how our suspects look like! Today, our police cameras are able to provide useful leads quickly to help us solve cases. And of course, as society progresses, actions by the police on the ground will sometimes get scrutinised by the public. It is a challenge that we have to deal with, and I always share with my officers that as long as we remain professional and stay true to our core values in every case we handle, we will be fine. (Continued in comments)",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What are the ranks of the officers in the image?\n",
        "question_and_answers": {
            "question_0": "What are the ranks of the officers in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_402.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_402.jpg",
        "caption": "[ ]The Police Workplan Seminar 2024 was held on 24 May 2024 at the Singapore University of Technology and Design. Deputy Prime Minster Heng Swee Keat was the Guest-of-Honour. He delivered the keynote speech and launched the Cyber Guardians on Watch and Cyber Crime Prevention Ambassadors schemes.The Cyber Guardians on Watch encourages individuals from all walks of life to play a role in safeguarding our cyberspace. Members of the scheme receive updates on the latest cybercrimes and scams, empowering them to spread awareness among their friends and loved ones. They serve as the eyes and ears of the SPF in the digital realm, reporting any suspicious activities.The Cyber Crime Prevention Ambassadors programme provides an avenue for members of the community who want to be more involved and take on an even more proactive role to safeguard our cyberspace. These ambassadors will undergo specialised training on emerging cybercrime trends and prevention measures, enabling them to educate the public through roadshows and community events.Initiatives to enhance cybercrime and scams-fighting capabilities and leverage Artificial Intelligence for new frontiers in policing were also unveiled at the seminar.The SPF constantly innovates and transforms itself to be a cyber-ready Police Force for the nation. Combatting cybercrimes, including scams, is a whole-of-society effort. Through ongoing collaboration with communities and stakeholders, the SPF remains dedicated to its mission of ensuring a safer Singapore for all.",
        "cleaned_caption": "The Police Workplan Seminar 2024 was held on 24 May 2024 at the Singapore University of Technology and Design. Deputy Prime Minister was the Guest-of-Honour. He delivered the keynote speech and launched the Cyber Guardians on Watch and Cyber Crime Prevention Ambassadors schemes. The Cyber Guardians on Watch encourages individuals from all walks of life to play a role in safeguarding our cyberspace. Members of the scheme receive updates on the latest cybercrimes and scams, empowering them to spread awareness among their friends and loved ones. They serve as the eyes and ears of the SPF in the digital realm, reporting any suspicious activities. The Cyber Crime Prevention Ambassadors programme provides an avenue for members of the community who want to be more involved and take on an even more proactive role to safeguard our cyberspace. These ambassadors will undergo specialised training on emerging cybercrime trends and prevention measures, enabling them to educate the public through roadshows and community events. Initiatives to enhance cybercrime and scams-fighting capabilities and leverage Artificial Intelligence for new frontiers in policing were also unveiled at the seminar. The SPF constantly innovates and transforms itself to be a cyber-ready Police Force for the nation. Combatting cybercrimes, including scams, is a whole-of-society effort. Through ongoing collaboration with communities and stakeholders, the SPF remains dedicated to its mission of ensuring a safer Singapore for all.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the topic of the keynote speech being delivered at the seminar?\n",
        "question_and_answers": {
            "question_0": "What is the topic of the keynote speech being delivered at the seminar?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_404.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_404.jpg",
        "caption": "[ ]The Police Workplan Seminar 2024 was held on 24 May 2024 at the Singapore University of Technology and Design. Deputy Prime Minster Heng Swee Keat was the Guest-of-Honour. He delivered the keynote speech and launched the Cyber Guardians on Watch and Cyber Crime Prevention Ambassadors schemes.The Cyber Guardians on Watch encourages individuals from all walks of life to play a role in safeguarding our cyberspace. Members of the scheme receive updates on the latest cybercrimes and scams, empowering them to spread awareness among their friends and loved ones. They serve as the eyes and ears of the SPF in the digital realm, reporting any suspicious activities.The Cyber Crime Prevention Ambassadors programme provides an avenue for members of the community who want to be more involved and take on an even more proactive role to safeguard our cyberspace. These ambassadors will undergo specialised training on emerging cybercrime trends and prevention measures, enabling them to educate the public through roadshows and community events.Initiatives to enhance cybercrime and scams-fighting capabilities and leverage Artificial Intelligence for new frontiers in policing were also unveiled at the seminar.The SPF constantly innovates and transforms itself to be a cyber-ready Police Force for the nation. Combatting cybercrimes, including scams, is a whole-of-society effort. Through ongoing collaboration with communities and stakeholders, the SPF remains dedicated to its mission of ensuring a safer Singapore for all.",
        "cleaned_caption": "The Police Workplan Seminar 2024 was held on 24 May 2024 at the Singapore University of Technology and Design. Deputy Prime Minister was the Guest-of-Honour. He delivered the keynote speech and launched the Cyber Guardians on Watch and Cyber Crime Prevention Ambassadors schemes. The Cyber Guardians on Watch encourages individuals from all walks of life to play a role in safeguarding our cyberspace. Members of the scheme receive updates on the latest cybercrimes and scams, empowering them to spread awareness among their friends and loved ones. They serve as the eyes and ears of the SPF in the digital realm, reporting any suspicious activities. The Cyber Crime Prevention Ambassadors programme provides an avenue for members of the community who want to be more involved and take on an even more proactive role to safeguard our cyberspace. These ambassadors will undergo specialised training on emerging cybercrime trends and prevention measures, enabling them to educate the public through roadshows and community events. Initiatives to enhance cybercrime and scams-fighting capabilities and leverage Artificial Intelligence for new frontiers in policing were also unveiled at the seminar. The SPF constantly innovates and transforms itself to be a cyber-ready Police Force for the nation. Combatting cybercrimes, including scams, is a whole-of-society effort. Through ongoing collaboration with communities and stakeholders, the SPF remains dedicated to its mission of ensuring a safer Singapore for all.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the main focus of the event being held at the Singapore University of Technology and Design?\n",
        "question_and_answers": {
            "question_0": "What is the main focus of the event being held at the Singapore University of Technology and Design?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_437.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_437.jpg",
        "caption": "[- ]The Singapore Police Force (SPF) hosted a Dining-In on 17 April 2024 in honour of Prime Minister (PM) Lee Hsien Loong at the Senior Police Officers Mess. More than 100 attendees were present, including Mr K Shanmugam, Minister for Home Affairs and Minister for Law; Mr Aubeck Kam, Permanent Secretary Home Affairs Development & Social and Family Development; and Mr Hoong Wee Teck, Commissioner of Police.The SPF hosted PM Lee at the same venue 10 years ago. At that Dining-In in 2014, PM Lee spoke about two areas which he said the SPF must never neglect. First, to maintain the highest standards of integrity, commitment, and professionalism, so that the publics strong trust in the SPF can be sustained. Second, to continue to invest in technology, so that the SPF can keep up with the latest threats, and deal with them effectively.Today, the publics trust in the SPF remains high. The SPF has also invested heavily in technology, and developed new capabilities. From expanding Police camera coverage and analytics, and harnessing unmanned systems as well as countering threats from them, to the use of artificial intelligence to fight scams, the SPF has been pushing technological boundaries.This has enabled our lean Force to keep crime rates low, solve crime swiftly, and hence secure the trust and confidence of Singaporeans.The Parliamentary Motion to commemorate SPF200 in 2021 was a significant milestone for the SPF. We thank PM Lee and the Parliament of Singapore for recognising the SPF as a world-class agency and SPF officers contributions in safeguarding Singapore. The SPF would like to thank PM Lee for the trust and support that PM Lee has given to the SPF. The SPF will continue to strive for the highest level of operational excellence and professionalism by upholding our core values of Courage, Loyalty, Integrity, and Fairness.Read more on (link in bio)",
        "cleaned_caption": "The Singapore Police Force (SPF) hosted a Dining-In on 17 April 2024 in honour of Prime Minister at the Senior Police Officers Mess. More than 100 attendees were present, including the Minister for Home Affairs and Minister for Law; the Permanent Secretary Home Affairs Development & Social and Family Development; and the Commissioner of Police. The SPF hosted PM Lee at the same venue 10 years ago. At that Dining-In in 2014, PM Lee spoke about two areas which he said the SPF must never neglect. First, to maintain the highest standards of integrity, commitment, and professionalism, so that the public's strong trust in the SPF can be sustained. Second, to continue to invest in technology, so that the SPF can keep up with the latest threats, and deal with them effectively. Today, the public's trust in the SPF remains high. The SPF has also invested heavily in technology, and developed new capabilities. From expanding Police camera coverage and analytics, and harnessing unmanned systems as well as countering threats from them, to the use of artificial intelligence to fight scams, the SPF has been pushing technological boundaries. This has enabled our lean Force to keep crime rates low, solve crime swiftly, and hence secure the trust and confidence of Singaporeans. The Parliamentary Motion to commemorate SPF200 in 2021 was a significant milestone for the SPF. We thank the Prime Minister and the Parliament of Singapore for recognising the SPF as a world-class agency and SPF officers' contributions in safeguarding Singapore. The SPF would like to thank the Prime Minister for the trust and support that has been given to the SPF. The SPF will continue to strive for the highest level of operational excellence and professionalism by upholding our core values of Courage, Loyalty, Integrity, and Fairness. Read more on (link in bio)",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the significance of hosting a Dining-In event for the Singapore Police Force at the Senior Police Officers Mess?\n",
        "question_and_answers": {
            "question_0": "What is the significance of hosting a Dining-In event for the Singapore Police Force at the Senior Police Officers Mess?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_442.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_442.jpg",
        "caption": "- \"\" Step back in time to the launch of the Neighbourhood Police Centre (NPC) system in 1997, pioneered by Queenstown Neighbourhood Centre. The NPCs served as one-stop police centres and brought wider range of police services to the community. It allowed the Police to work in, with and through the community via the community safety and security programmes.In 2012, the Community Policing System was introduced to further strengthen the partnership with the community. The NPCs were restructured to include the Community Policing Unit and Crime Strike Force to encourage joint ownership and responsibility with the community countering terrorism and fighting crime. Technology was harnessed as a force multiplier and the Neighbourhood Police Posts were enhanced to provide the community with round-the-clock access to automated services.We will continue to enhance police-community partnership to keep Singapore safe and secure every day.singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "Step back in time to the launch of the Neighbourhood Police Centre (NPC) system in 1997, pioneered by Queenstown Neighbourhood Centre. The NPCs served as one-stop police centres and brought a wider range of police services to the community. It allowed the Police to work in, with and through the community via the community safety and security programmes. In 2012, the Community Policing System was introduced to further strengthen the partnership with the community. The NPCs were restructured to include the Community Policing Unit and Crime Strike Force to encourage joint ownership and responsibility with the community countering terrorism and fighting crime. Technology was harnessed as a force multiplier and the Neighbourhood Police Posts were enhanced to provide the community with round-the-clock access to automated services. We will continue to enhance police-community partnership to keep Singapore safe and secure every day. #singaporepoliceforce #safeguideveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the name displayed on the building in the image?\n",
        "question_and_answers": {
            "question_0": "What is the name displayed on the building in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_460.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_460.jpg",
        "caption": "() On 26 October 2023, off-duty SI Alif Rashid spotted a boy in his primary school uniform loitering at a HDB void deck near a supermarket in Punggol in the late evening. As school dismissals are usually in the early afternoon, Alif sensed that something was amiss, and he decided to approach the boy. The boy shared that he had lost his way and could not find the way home.SI Alif noticed that the boy had a phone with him, but the battery was flat. He offered to charge his phone so that the boy could contact his family. In the meantime, he bought food and drinks for the boy as he did not have any food since early afternoon. After SI Alif successfully turned the boys phone on, he noticed that there were more than 5 missed calls from various numbers. Immediately, he contacted one of the numbers, which belonged to the boys grandfather.Over the phone, the boys grandfather told SI Alif that they had been looking for him for the past few hours and they were very worried. SI Alif then informed the boys grandfather that he is a police officer and that he approached the boy as he sensed that something was off. SI Alif waited with the boy until his family reunited with him at the void deck.After the incident, one of the boys family members wrote to the Police to compliment SI Alif, I dont know how to thank the officer.. He even buy food and offer care until my daughter came to fetch my grandson. I would like to recommend this officer for his good Samaritans deed..As a parent, I can understand how the boys family felt when they could not reach him for hours. I am happy to be able to do a small part to help to reunite the boy with his family, said SI Alif. singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "On 26 October 2023, off-duty SI spotted a boy in his primary school uniform loitering at a HDB void deck near a supermarket in Punggol in the late evening. As school dismissals are usually in the early afternoon, SI sensed that something was amiss and decided to approach the boy. The boy shared that he had lost his way and could not find the way home. SI noticed that the boy had a phone with him, but the battery was flat. He offered to charge his phone so that the boy could contact his family. In the meantime, he bought food and drinks for the boy as he did not have any food since early afternoon. After SI successfully turned the boy's phone on, he noticed that there were more than 5 missed calls from various numbers. Immediately, he contacted one of the numbers, which belonged to the boy's grandfather. Over the phone, the grandfather told SI that they had been looking for him for the past few hours and they were very worried. SI then informed the grandfather that he is a police officer and that he approached the boy as he sensed that something was off. SI waited with the boy until his family reunited with him at the void deck. After the incident, one of the boy's family members wrote to the Police to compliment SI, expressing gratitude for his actions. As a parent, SI can understand how the boy's family felt when they could not reach him for hours. He expressed happiness to be able to do a small part to help reunite the boy with his family. #singaporepoliceforce #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What type of boats are visible in the image behind the individual?\n",
        "question_and_answers": {
            "question_0": "What type of boats are visible in the image behind the individual?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_462.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_462.jpg",
        "caption": "() On 26 October 2023, off-duty SI Alif Rashid spotted a boy in his primary school uniform loitering at a HDB void deck near a supermarket in Punggol in the late evening. As school dismissals are usually in the early afternoon, Alif sensed that something was amiss, and he decided to approach the boy. The boy shared that he had lost his way and could not find the way home.SI Alif noticed that the boy had a phone with him, but the battery was flat. He offered to charge his phone so that the boy could contact his family. In the meantime, he bought food and drinks for the boy as he did not have any food since early afternoon. After SI Alif successfully turned the boys phone on, he noticed that there were more than 5 missed calls from various numbers. Immediately, he contacted one of the numbers, which belonged to the boys grandfather.Over the phone, the boys grandfather told SI Alif that they had been looking for him for the past few hours and they were very worried. SI Alif then informed the boys grandfather that he is a police officer and that he approached the boy as he sensed that something was off. SI Alif waited with the boy until his family reunited with him at the void deck.After the incident, one of the boys family members wrote to the Police to compliment SI Alif, I dont know how to thank the officer.. He even buy food and offer care until my daughter came to fetch my grandson. I would like to recommend this officer for his good Samaritans deed..As a parent, I can understand how the boys family felt when they could not reach him for hours. I am happy to be able to do a small part to help to reunite the boy with his family, said SI Alif. singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "On 26 October 2023, off-duty SI spotted a boy in his primary school uniform loitering at a HDB void deck near a supermarket in Punggol in the late evening. As school dismissals are usually in the early afternoon, SI sensed that something was amiss, and decided to approach the boy. The boy shared that he had lost his way and could not find the way home. SI noticed that the boy had a phone with him, but the battery was flat. He offered to charge the phone so that the boy could contact his family. In the meantime, he bought food and drinks for the boy as he did not have any food since early afternoon. After SI successfully turned the boy's phone on, he noticed that there were more than 5 missed calls from various numbers. Immediately, he contacted one of the numbers, which belonged to the boy’s grandfather. Over the phone, the grandfather told SI that they had been looking for him for the past few hours and were very worried. SI then informed the grandfather that he is a police officer and that he approached the boy as he sensed that something was off. SI waited with the boy until his family reunited with him at the void deck. After the incident, one of the boy's family members wrote to the Police to compliment SI, stating gratitude for the officer's assistance, including buying food and offering care until the family arrived. As a parent, I can understand how the boy’s family felt when they could not reach him for hours. I am happy to be able to do a small part to help reunite the boy with his family, said SI. #singaporepoliceforce #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the person in the image doing on the phone?\n",
        "question_and_answers": {
            "question_0": "What is the person in the image doing on the phone?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_463.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_463.jpg",
        "caption": "() On 26 October 2023, off-duty SI Alif Rashid spotted a boy in his primary school uniform loitering at a HDB void deck near a supermarket in Punggol in the late evening. As school dismissals are usually in the early afternoon, Alif sensed that something was amiss, and he decided to approach the boy. The boy shared that he had lost his way and could not find the way home.SI Alif noticed that the boy had a phone with him, but the battery was flat. He offered to charge his phone so that the boy could contact his family. In the meantime, he bought food and drinks for the boy as he did not have any food since early afternoon. After SI Alif successfully turned the boys phone on, he noticed that there were more than 5 missed calls from various numbers. Immediately, he contacted one of the numbers, which belonged to the boys grandfather.Over the phone, the boys grandfather told SI Alif that they had been looking for him for the past few hours and they were very worried. SI Alif then informed the boys grandfather that he is a police officer and that he approached the boy as he sensed that something was off. SI Alif waited with the boy until his family reunited with him at the void deck.After the incident, one of the boys family members wrote to the Police to compliment SI Alif, I dont know how to thank the officer.. He even buy food and offer care until my daughter came to fetch my grandson. I would like to recommend this officer for his good Samaritans deed..As a parent, I can understand how the boys family felt when they could not reach him for hours. I am happy to be able to do a small part to help to reunite the boy with his family, said SI Alif. singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "On 26 October 2023, off-duty SI spotted a boy in his primary school uniform loitering at a HDB void deck near a supermarket in Punggol in the late evening. As school dismissals are usually in the early afternoon, SI sensed that something was amiss, and he decided to approach the boy. The boy shared that he had lost his way and could not find the way home. SI noticed that the boy had a phone with him, but the battery was flat. He offered to charge the boy's phone so that he could contact his family. In the meantime, he bought food and drinks for the boy as he did not have any food since early afternoon. After SI successfully turned the boy's phone on, he noticed that there were more than 5 missed calls from various numbers. Immediately, he contacted one of the numbers, which belonged to the boy's grandfather. Over the phone, the grandfather told SI that they had been looking for him for the past few hours and they were very worried. SI then informed the grandfather that he is a police officer and that he approached the boy as he sensed that something was off. SI waited with the boy until his family reunited with him at the void deck. After the incident, one of the boy's family members wrote to the Police to compliment SI, expressing gratitude for his good Samaritan deed, stating they appreciated the care shown until their family member was safely retrieved. As a parent, I can understand how the family felt when they could not reach him for hours. I am happy to have been able to do a small part to help reunite the boy with his family, said SI. #sgpoliceforce #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the boy in the image doing with his phone?\n",
        "question_and_answers": {
            "question_0": "What is the boy in the image doing with his phone?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_464.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_464.jpg",
        "caption": "() On 26 October 2023, off-duty SI Alif Rashid spotted a boy in his primary school uniform loitering at a HDB void deck near a supermarket in Punggol in the late evening. As school dismissals are usually in the early afternoon, Alif sensed that something was amiss, and he decided to approach the boy. The boy shared that he had lost his way and could not find the way home.SI Alif noticed that the boy had a phone with him, but the battery was flat. He offered to charge his phone so that the boy could contact his family. In the meantime, he bought food and drinks for the boy as he did not have any food since early afternoon. After SI Alif successfully turned the boys phone on, he noticed that there were more than 5 missed calls from various numbers. Immediately, he contacted one of the numbers, which belonged to the boys grandfather.Over the phone, the boys grandfather told SI Alif that they had been looking for him for the past few hours and they were very worried. SI Alif then informed the boys grandfather that he is a police officer and that he approached the boy as he sensed that something was off. SI Alif waited with the boy until his family reunited with him at the void deck.After the incident, one of the boys family members wrote to the Police to compliment SI Alif, I dont know how to thank the officer.. He even buy food and offer care until my daughter came to fetch my grandson. I would like to recommend this officer for his good Samaritans deed..As a parent, I can understand how the boys family felt when they could not reach him for hours. I am happy to be able to do a small part to help to reunite the boy with his family, said SI Alif. singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "On 26 October 2023, off-duty SI spotted a boy in his primary school uniform loitering at a HDB void deck near a supermarket in Punggol in the late evening. As school dismissals are usually in the early afternoon, SI sensed that something was amiss, and he decided to approach the boy. The boy shared that he had lost his way and could not find the way home. SI noticed that the boy had a phone with him, but the battery was flat. He offered to charge his phone so that the boy could contact his family. In the meantime, he bought food and drinks for the boy as he did not have any food since early afternoon. After SI successfully turned the boy's phone on, he noticed that there were more than 5 missed calls from various numbers. Immediately, he contacted one of the numbers, which belonged to the boy's grandfather. Over the phone, the grandfather told SI that they had been looking for him for the past few hours and they were very worried. SI then informed the grandfather that he is a police officer and that he approached the boy as he sensed that something was off. SI waited with the boy until his family reunited with him at the void deck. After the incident, one of the boy's family members wrote to the Police to compliment SI, expressing gratitude for buying food and offering care until the family arrived. As a parent, I can understand how the boy's family felt when they could not reach him for hours. I am happy to be able to do a small part to help to reunite the boy with his family, said SI. #sgpoliceforce #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the boy in the primary school uniform doing at the HDB void deck?\n",
        "question_and_answers": {
            "question_0": "What is the boy in the primary school uniform doing at the HDB void deck?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_580.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_580.jpg",
        "caption": "[- ] The Traffic Police, together with the Singapore Road Safety Council (SRSC), held the Anti-Drink Drive Campaign 2023 on 29 November.As part of the campaign, the Guest-Of-Honour MOS Faishal unveiled the campaign tagline, Make the Right Choice: Dont Drink and Drive, to remind motorists to prioritise safety by refraining from driving after consuming alcohol. Remember, drink-driving is an irresponsible act and as we approach the festive season, we would like to remind all motorists to Make the Right Choice to keep our roads safe for everyone. singaporepoliceforcesafeguardingeveryday",
        "cleaned_caption": "The Traffic Police, together with the Singapore Road Safety Council (SRSC), held the Anti-Drink Drive Campaign 2023 on 29 November. As part of the campaign, the Guest-Of-Honour unveiled the campaign tagline, Make the Right Choice: Don't Drink and Drive, to remind motorists to prioritise safety by refraining from driving after consuming alcohol. Remember, drink-driving is an irresponsible act and as we approach the festive season, we would like to remind all motorists to Make the Right Choice to keep our roads safe for everyone.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the main message being conveyed in the campaign tagline in the image?\n",
        "question_and_answers": {
            "question_0": "What is the main message being conveyed in the campaign tagline in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_582.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_582.jpg",
        "caption": "[- ] The Traffic Police, together with the Singapore Road Safety Council (SRSC), held the Anti-Drink Drive Campaign 2023 on 29 November.As part of the campaign, the Guest-Of-Honour MOS Faishal unveiled the campaign tagline, Make the Right Choice: Dont Drink and Drive, to remind motorists to prioritise safety by refraining from driving after consuming alcohol. Remember, drink-driving is an irresponsible act and as we approach the festive season, we would like to remind all motorists to Make the Right Choice to keep our roads safe for everyone. singaporepoliceforcesafeguardingeveryday",
        "cleaned_caption": "The Traffic Police, together with the Singapore Road Safety Council (SRSC), held the Anti-Drink Drive Campaign 2023 on 29 November. As part of the campaign, the Guest-Of-Honour unveiled the campaign tagline, Make the Right Choice: Don't Drink and Drive, to remind motorists to prioritise safety by refraining from driving after consuming alcohol. Remember, drink-driving is an irresponsible act and as we approach the festive season, we would like to remind all motorists to Make the Right Choice to keep our roads safe for everyone.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What campaign is being promoted in this image?\n",
        "question_and_answers": {
            "question_0": "What campaign is being promoted in this image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_622.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_622.jpg",
        "caption": "The Singapore Police Force is one of the oldest institutions in Singapore, stretching back more than 200 years.Look back at the SPFs Heritage in this weeks SPF Glossary!singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "The Singapore Police Force is one of the oldest institutions in Singapore, stretching back more than 200 years. Look back at the SPFs Heritage in this week's SPF Glossary! #singaporepoliceforce #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the scene depicted in the image featuring the group of individuals in uniform?\n",
        "question_and_answers": {
            "question_0": "What is the scene depicted in the image featuring the group of individuals in uniform?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_650.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_650.jpg",
        "caption": "The Forensics Division of the Criminal Investigation Department is the authority on crime scene forensic matters in the SPF. Forensic Specialists leverage technology to analyse and process evidence gathered at the crime scenes efficiently and accurately to provide investigative leads. For example, fingerprints lifted at scene are screened through the Automated Fingerprint Identification Systems to identify possible suspects. Forensic specialists are also equipped with presumptive blood screening kits to perform rapid, on-site preliminary tests to differentiate between potential blood traces and other stains that resemble blood. Learn how they bring the truth to light in this weeks SPF Glossary! singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "The Forensics Division of the Criminal Investigation Department is the authority on crime scene forensic matters in the SPF. Forensic Specialists leverage technology to analyse and process evidence gathered at the crime scenes efficiently and accurately to provide investigative leads. For example, fingerprints lifted at the scene are screened through the Automated Fingerprint Identification Systems to identify possible suspects. Forensic specialists are also equipped with presumptive blood screening kits to perform rapid, on-site preliminary tests to differentiate between potential blood traces and other stains that resemble blood. Learn how they bring the truth to light in this week's SPF Glossary!",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What type of evidence is the forensic specialist analyzing in the image?\n",
        "question_and_answers": {
            "question_0": "What type of evidence is the forensic specialist analyzing in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_764.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_764.jpg",
        "caption": "",
        "cleaned_caption": "The caption provided is empty, so I will return an empty string.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the color of the substance smeared on the door in the image?\n",
        "question_and_answers": {
            "question_0": "What is the color of the substance smeared on the door in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_765.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_765.jpg",
        "caption": "",
        "cleaned_caption": "The caption you provided is empty. Therefore, I will return an empty string.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What message is written on the paper in the image?\n",
        "question_and_answers": {
            "question_0": "What message is written on the paper in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_771.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_771.jpg",
        "caption": "Constructed in 2006, the Boarding and Search Trainer (BST) is purpose-built and designed to resemble a merchant cargo vessel. The BST provides a realistic training environment for Police Coast Guard (PCG) officers to train their operational tactics. The BST has a 25 meters indoor firing range that is specially designed for various tactical firearms training. Thunder flashes and stun grenades can be deployed in the range to support complex training requirements. It also comes installed with a Range Management System allowing officers to remotely manage the electronic target system and simulate various lighting conditions and sound environments. The newly installed Rope Access Platform consists of fast roping beams and rappelling anchor points. This facility allows multiple personnel to descend simultaneously, providing a rapid and efficient means of insertion into a hostile vessel. This new platform will enable officers to train and practise quick and safe descent from elevated positions to a cushioned lower platform. There are also Close-Quarters Battle Areas within the BST that can accommodate both live firing and non-live firing trainings. The non-live firing area consists of single to multiple rooms setting, and the rooms are built with hidden compartments and false ceilings to train officers in vessel rummaging. The live-firing area in each deck is made up of a modular layout that allows the setup for the deck to be changed for each training session, helping to increase the realism of the training as the participants cannot predict the decks layout. The BST enhances the training of PCG officers to ensure they are operationally ready to safeguard Singapores territorial waters every day. singaporepoliceforcesafeguardingeveryday",
        "cleaned_caption": "Constructed in 2006, the Boarding and Search Trainer (BST) is purpose-built and designed to resemble a merchant cargo vessel. The BST provides a realistic training environment for Police Coast Guard (PCG) officers to train their operational tactics. The BST has a 25 meters indoor firing range that is specially designed for various tactical firearms training. Thunder flashes and stun grenades can be deployed in the range to support complex training requirements. It also comes installed with a Range Management System allowing officers to remotely manage the electronic target system and simulate various lighting conditions and sound environments. The newly installed Rope Access Platform consists of fast roping beams and rappelling anchor points. This facility allows multiple personnel to descend simultaneously, providing a rapid and efficient means of insertion into a hostile vessel. This new platform will enable officers to train and practise quick and safe descent from elevated positions to a cushioned lower platform. There are also Close-Quarters Battle Areas within the BST that can accommodate both live firing and non-live firing trainings. The non-live firing area consists of single to multiple rooms setting, and the rooms are built with hidden compartments and false ceilings to train officers in vessel rummaging. The live-firing area in each deck is made up of a modular layout that allows the setup for the deck to be changed for each training session, helping to increase the realism of the training as the participants cannot predict the decks layout. The BST enhances the training of PCG officers to ensure they are operationally ready to safeguard Singapore's territorial waters every day.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What are the police officers in the image holding?\n",
        "question_and_answers": {
            "question_0": "What are the police officers in the image holding?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_773.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_773.jpg",
        "caption": "Constructed in 2006, the Boarding and Search Trainer (BST) is purpose-built and designed to resemble a merchant cargo vessel. The BST provides a realistic training environment for Police Coast Guard (PCG) officers to train their operational tactics. The BST has a 25 meters indoor firing range that is specially designed for various tactical firearms training. Thunder flashes and stun grenades can be deployed in the range to support complex training requirements. It also comes installed with a Range Management System allowing officers to remotely manage the electronic target system and simulate various lighting conditions and sound environments. The newly installed Rope Access Platform consists of fast roping beams and rappelling anchor points. This facility allows multiple personnel to descend simultaneously, providing a rapid and efficient means of insertion into a hostile vessel. This new platform will enable officers to train and practise quick and safe descent from elevated positions to a cushioned lower platform. There are also Close-Quarters Battle Areas within the BST that can accommodate both live firing and non-live firing trainings. The non-live firing area consists of single to multiple rooms setting, and the rooms are built with hidden compartments and false ceilings to train officers in vessel rummaging. The live-firing area in each deck is made up of a modular layout that allows the setup for the deck to be changed for each training session, helping to increase the realism of the training as the participants cannot predict the decks layout. The BST enhances the training of PCG officers to ensure they are operationally ready to safeguard Singapores territorial waters every day. singaporepoliceforcesafeguardingeveryday",
        "cleaned_caption": "Constructed in 2006, the Boarding and Search Trainer (BST) is purpose-built and designed to resemble a merchant cargo vessel. The BST provides a realistic training environment for Police Coast Guard (PCG) officers to train their operational tactics. The BST has a 25 meters indoor firing range that is specially designed for various tactical firearms training. Thunder flashes and stun grenades can be deployed in the range to support complex training requirements. It also comes installed with a Range Management System allowing officers to remotely manage the electronic target system and simulate various lighting conditions and sound environments. The newly installed Rope Access Platform consists of fast roping beams and rappelling anchor points. This facility allows multiple personnel to descend simultaneously, providing a rapid and efficient means of insertion into a hostile vessel. This new platform will enable officers to train and practise quick and safe descent from elevated positions to a cushioned lower platform. There are also Close-Quarters Battle Areas within the BST that can accommodate both live firing and non-live firing trainings. The non-live firing area consists of single to multiple rooms setting, and the rooms are built with hidden compartments and false ceilings to train officers in vessel rummaging. The live-firing area in each deck is made up of a modular layout that allows the setup for the deck to be changed for each training session, helping to increase the realism of the training as the participants cannot predict the decks layout. The BST enhances the training of PCG officers to ensure they are operationally ready to safeguard Singapore's territorial waters every day.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the role of the individuals in tactical gear within the depicted training scenario?\n",
        "question_and_answers": {
            "question_0": "What is the role of the individuals in tactical gear within the depicted training scenario?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_774.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_774.jpg",
        "caption": "Constructed in 2006, the Boarding and Search Trainer (BST) is purpose-built and designed to resemble a merchant cargo vessel. The BST provides a realistic training environment for Police Coast Guard (PCG) officers to train their operational tactics. The BST has a 25 meters indoor firing range that is specially designed for various tactical firearms training. Thunder flashes and stun grenades can be deployed in the range to support complex training requirements. It also comes installed with a Range Management System allowing officers to remotely manage the electronic target system and simulate various lighting conditions and sound environments. The newly installed Rope Access Platform consists of fast roping beams and rappelling anchor points. This facility allows multiple personnel to descend simultaneously, providing a rapid and efficient means of insertion into a hostile vessel. This new platform will enable officers to train and practise quick and safe descent from elevated positions to a cushioned lower platform. There are also Close-Quarters Battle Areas within the BST that can accommodate both live firing and non-live firing trainings. The non-live firing area consists of single to multiple rooms setting, and the rooms are built with hidden compartments and false ceilings to train officers in vessel rummaging. The live-firing area in each deck is made up of a modular layout that allows the setup for the deck to be changed for each training session, helping to increase the realism of the training as the participants cannot predict the decks layout. The BST enhances the training of PCG officers to ensure they are operationally ready to safeguard Singapores territorial waters every day. singaporepoliceforcesafeguardingeveryday",
        "cleaned_caption": "Constructed in 2006, the Boarding and Search Trainer (BST) is purpose-built and designed to resemble a merchant cargo vessel. The BST provides a realistic training environment for Police Coast Guard (PCG) officers to train their operational tactics. The BST has a 25 meters indoor firing range that is specially designed for various tactical firearms training. Thunder flashes and stun grenades can be deployed in the range to support complex training requirements. It also comes installed with a Range Management System allowing officers to remotely manage the electronic target system and simulate various lighting conditions and sound environments. The newly installed Rope Access Platform consists of fast roping beams and rappelling anchor points. This facility allows multiple personnel to descend simultaneously, providing a rapid and efficient means of insertion into a hostile vessel. This new platform will enable officers to train and practise quick and safe descent from elevated positions to a cushioned lower platform. There are also Close-Quarters Battle Areas within the BST that can accommodate both live firing and non-live firing trainings. The non-live firing area consists of single to multiple rooms setting, and the rooms are built with hidden compartments and false ceilings to train officers in vessel rummaging. The live-firing area in each deck is made up of a modular layout that allows the setup for the deck to be changed for each training session, helping to increase the realism of the training as the participants cannot predict the decks layout. The BST enhances the training of PCG officers to ensure they are operationally ready to safeguard Singapore's territorial waters every day.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What are the officers in the image preparing to do?\n",
        "question_and_answers": {
            "question_0": "What are the officers in the image preparing to do?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_781.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_781.jpg",
        "caption": "-",
        "cleaned_caption": "\"\"",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the main content of the message displayed in the screenshot?\n",
        "question_and_answers": {
            "question_0": "What is the main content of the message displayed in the screenshot?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_798.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_798.jpg",
        "caption": ": The Annual Police Dinner 2023 was an evening of appreciation and celebration, and the SPF was honoured to present President Halimah Yacob with the Temasek Sword in recognition of her unwavering support for our officers. Find out more about this moment and other highlights from a very special evening. Check out the Police Life article link in our bio for more details. spfpolicelife safeguardingeveryday singaporepoliceforce",
        "cleaned_caption": "The Annual Police Dinner 2023 was an evening of appreciation and celebration, and the SPF was honoured to present the President with the Temasek Sword in recognition of her unwavering support for our officers. Find out more about this moment and other highlights from a very special evening. Check out the Police Life article link in our bio for more details. spfpolicelife safeguardingeveryday singaporepoliceforce",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the main subject depicted in the artwork related to the Police Day Parade 2022?\n",
        "question_and_answers": {
            "question_0": "What is the main subject depicted in the artwork related to the Police Day Parade 2022?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_808.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_808.jpg",
        "caption": "",
        "cleaned_caption": "``` \n```",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What items are displayed in the image related to the enforcement operation?\n",
        "question_and_answers": {
            "question_0": "What items are displayed in the image related to the enforcement operation?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_809.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_809.jpg",
        "caption": "",
        "cleaned_caption": "The caption is empty.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What items are visible in the image that are associated with the illegal codeine operation?\n",
        "question_and_answers": {
            "question_0": "What items are visible in the image that are associated with the illegal codeine operation?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_811.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_811.jpg",
        "caption": "",
        "cleaned_caption": "The caption is empty.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What types of products are displayed in the image on the left?\n",
        "question_and_answers": {
            "question_0": "What types of products are displayed in the image on the left?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_812.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_812.jpg",
        "caption": "",
        "cleaned_caption": "There is no caption provided to process.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What items are visible in the image that suggest illegal activity related to health products?\n",
        "question_and_answers": {
            "question_0": "What items are visible in the image that suggest illegal activity related to health products?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_813.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_813.jpg",
        "caption": "",
        "cleaned_caption": "The caption is empty.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What types of health products are displayed in the containers shown in the image?\n",
        "question_and_answers": {
            "question_0": "What types of health products are displayed in the containers shown in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_816.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_816.jpg",
        "caption": "",
        "cleaned_caption": "",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What types of currency are visible in the image?\n",
        "question_and_answers": {
            "question_0": "What types of currency are visible in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_876.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_876.jpg",
        "caption": "() , Inspired by the Hong Kong TV police dramas in the 1990s, AC Serene Chiu joined the Singapore Police Force in 1999. She has since stayed on for over 23 years.For officers who have worked with her, you would have known her as someone who is jovial, yet focused, driven and firm during operations and missions. AC Serene Chiu now leads Clementi Police Division, which was recently named the Best Land Division at the Police Day Parade on 3 June 2023. Today, we speak to her to find out what are the secrets in winning the award.Theres no secret in winning (laughs)! But I do like to credit my officers for maintaining a high standard of operational excellence and professionalism. They will chase down every lead to solve every crime they can and ensure justice is served. The Division is outstanding because of its people who give their utmost to keep Singapore safe and secure every day.And of course, I would also like to thank our community partners and stakeholders, who have actively contributed to creating safer communities. Technology plays an important role too. We use data-driven approach to identify crime patterns to better plan our deterrence patrols and crime prevention efforts, and Police cameras have been effective in helping us deter and solve crimes.[To be continued]",
        "cleaned_caption": "Inspired by the Hong Kong TV police dramas in the 1990s, AC Serene Chiu joined the Singapore Police Force in 1999. She has since stayed on for over 23 years. For officers who have worked with her, you would have known her as someone who is jovial, yet focused, driven and firm during operations and missions. AC Serene Chiu now leads Clementi Police Division, which was recently named the Best Land Division at the Police Day Parade on 3 June 2023. Today, we speak to her to find out what are the secrets in winning the award. There's no secret in winning (laughs)! But I do like to credit my officers for maintaining a high standard of operational excellence and professionalism. They will chase down every lead to solve every crime they can and ensure justice is served. The Division is outstanding because of its people who give their utmost to keep Singapore safe and secure every day. And of course, I would also like to thank our community partners and stakeholders, who have actively contributed to creating safer communities. Technology plays an important role too. We use a data-driven approach to identify crime patterns to better plan our deterrence patrols and crime prevention efforts, and Police cameras have been effective in helping us deter and solve crimes. [To be continued]",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What award is being presented in this image?\n",
        "question_and_answers": {
            "question_0": "What award is being presented in this image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_877.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_877.jpg",
        "caption": "() , Inspired by the Hong Kong TV police dramas in the 1990s, AC Serene Chiu joined the Singapore Police Force in 1999. She has since stayed on for over 23 years.For officers who have worked with her, you would have known her as someone who is jovial, yet focused, driven and firm during operations and missions. AC Serene Chiu now leads Clementi Police Division, which was recently named the Best Land Division at the Police Day Parade on 3 June 2023. Today, we speak to her to find out what are the secrets in winning the award.Theres no secret in winning (laughs)! But I do like to credit my officers for maintaining a high standard of operational excellence and professionalism. They will chase down every lead to solve every crime they can and ensure justice is served. The Division is outstanding because of its people who give their utmost to keep Singapore safe and secure every day.And of course, I would also like to thank our community partners and stakeholders, who have actively contributed to creating safer communities. Technology plays an important role too. We use data-driven approach to identify crime patterns to better plan our deterrence patrols and crime prevention efforts, and Police cameras have been effective in helping us deter and solve crimes.[To be continued]",
        "cleaned_caption": "Inspired by the Hong Kong TV police dramas in the 1990s, AC Chiu joined the Singapore Police Force in 1999. She has since stayed on for over 23 years. For officers who have worked with her, you would have known her as someone who is jovial, yet focused, driven and firm during operations and missions. AC Chiu now leads Clementi Police Division, which was recently named the Best Land Division at the Police Day Parade on 3 June 2023. Today, we speak to her to find out what are the secrets in winning the award. There’s no secret in winning (laughs)! But I do like to credit my officers for maintaining a high standard of operational excellence and professionalism. They will chase down every lead to solve every crime they can and ensure justice is served. The Division is outstanding because of its people who give their utmost to keep Singapore safe and secure every day. And of course, I would also like to thank our community partners and stakeholders, who have actively contributed to creating safer communities. Technology plays an important role too. We use a data-driven approach to identify crime patterns to better plan our deterrence patrols and crime prevention efforts, and Police cameras have been effective in helping us deter and solve crimes. [To be continued]",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What kind of uniforms are the officers wearing in the image?\n",
        "question_and_answers": {
            "question_0": "What kind of uniforms are the officers wearing in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_939.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_939.jpg",
        "caption": "My two-and-a-half years old twin girls were either asleep when I got home, or when I left for work, recalled DAC Tay of the early days of her Checkpoints posting, when her team had to conduct multiple exercises at the checkpoints during odd hours, in order to avoid the morning and evening peak periods.That was when my mum guilt would kick in, she shared, but at the end of the day, everything worked out because of the strong support I received from my family, supervisors and team. Now that her twins are 12 years old, DAC Tay says with a chuckle that shes become their excuse to stay up past bedtime, as they eagerly wait for me to come home after my work! Happy Mothers Day to all the mothers out there!",
        "cleaned_caption": "My two-and-a-half years old twin girls were either asleep when I got home, or when I left for work, recalled DAC Tay of the early days of her Checkpoints posting, when her team had to conduct multiple exercises at the checkpoints during odd hours, in order to avoid the morning and evening peak periods. That was when my mum guilt would kick in, she shared, but at the end of the day, everything worked out because of the strong support I received from my family, supervisors and team. Now that her twins are 12 years old, DAC Tay says with a chuckle that she’s become their excuse to stay up past bedtime, as they eagerly wait for me to come home after my work! Happy Mothers Day to all the mothers out there!",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the significance of DAC Tay's role in managing checkpoint operations?\n",
        "question_and_answers": {
            "question_0": "What is the significance of DAC Tay's role in managing checkpoint operations?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_940.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_940.jpg",
        "caption": "My two-and-a-half years old twin girls were either asleep when I got home, or when I left for work, recalled DAC Tay of the early days of her Checkpoints posting, when her team had to conduct multiple exercises at the checkpoints during odd hours, in order to avoid the morning and evening peak periods.That was when my mum guilt would kick in, she shared, but at the end of the day, everything worked out because of the strong support I received from my family, supervisors and team. Now that her twins are 12 years old, DAC Tay says with a chuckle that shes become their excuse to stay up past bedtime, as they eagerly wait for me to come home after my work! Happy Mothers Day to all the mothers out there!",
        "cleaned_caption": "My two-and-a-half years old twin girls were either asleep when I got home, or when I left for work, recalled DAC Tay of the early days of her Checkpoints posting, when her team had to conduct multiple exercises at the checkpoints during odd hours, in order to avoid the morning and evening peak periods. That was when my mum guilt would kick in, she shared, but at the end of the day, everything worked out because of the strong support I received from my family, supervisors and team. Now that her twins are 12 years old, DAC Tay says with a chuckle that she’s become their excuse to stay up past bedtime, as they eagerly wait for me to come home after my work! Happy Mothers Day to all the mothers out there!",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What event or setting is happening in the background of this image?\n",
        "question_and_answers": {
            "question_0": "What event or setting is happening in the background of this image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1112.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1112.jpg",
        "caption": ", : , . .My family and I were enjoying our afternoon at home during my day off on 28 Sep 2020. This peacefulness was interrupted when we suddenly heard screams of a woman coming from downstairs. My house on the third floor overlooks the carpark. As I peered out, a shocking sight greeted me a young lady was frantically fleeing from a knife-wielding man!The woman was screaming and clearly in distress. I know this might sound quite dramatic but I quickly dashed out of the house while telling my family members I need to go down, I need to save the girl!.It wasnt wise to confront a man with a knife alone so as I ran past some migrant workers who were working nearby, I asked if they had anything I could use to protect myself. They quickly handed me a hoe from their worksite and I ran towards the couple.Once at the carpark, I saw that a driver had stopped and used his car to block the man from reaching the woman. The man was still waving his knife and shouting incoherently.A crowd had already formed by then. For everyones safety, I knew I had to defuse the situation as soon as possible. I addressed him calmly. Im a police officer. Please drop your knife.Suddenly, he began charging towards me with his knife. Fortunately, I managed to deflect his blow by quickly swinging the hoe at him. He backed away. I saw the mans eyes darting around when he realised that there wasnt anywhere for him to run. The crowd had him surrounded. In a panic, he pointed the knife towards himself and started slashing at his own arms.I took this chance to quickly grab his wrist and disarmed him. Some nearby onlookers then rushed in and together we successfully subdued the man. Soon enough, police officers arrived and arrested him. Both the man and woman were later brought to a hospital to treat their injuries. [To be continued in comment section]",
        "cleaned_caption": "My family and I were enjoying our afternoon at home during my day off on 28 Sep 2020. This peacefulness was interrupted when we suddenly heard screams of a woman coming from downstairs. My house on the third floor overlooks the carpark. As I peered out, a shocking sight greeted me – a young lady was frantically fleeing from a knife-wielding man! The woman was screaming and clearly in distress. I know this might sound quite dramatic but I quickly dashed out of the house while telling my family members I need to go down, I need to save the girl! It wasn't wise to confront a man with a knife alone so as I ran past some migrant workers who were working nearby, I asked if they had anything I could use to protect myself. They quickly handed me a hoe from their worksite and I ran towards the couple. Once at the carpark, I saw that a driver had stopped and used his car to block the man from reaching the woman. The man was still waving his knife and shouting incoherently. A crowd had already formed by then. For everyone's safety, I knew I had to defuse the situation as soon as possible. I addressed him calmly. I'm a police officer. Please drop your knife. Suddenly, he began charging towards me with his knife. Fortunately, I managed to deflect his blow by quickly swinging the hoe at him. He backed away. I saw the man's eyes darting around when he realised that there wasn't anywhere for him to run. The crowd had him surrounded. In a panic, he pointed the knife towards himself and started slashing at his own arms. I took this chance to quickly grab his wrist and disarmed him. Some nearby onlookers then rushed in and together we successfully subdued the man. Soon enough, police officers arrived and arrested him. Both the man and woman were later brought to a hospital to treat their injuries. [To be continued in comment section]",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the uniform of the person in the image designed to represent?\n",
        "question_and_answers": {
            "question_0": "What is the uniform of the person in the image designed to represent?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1114.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1114.jpg",
        "caption": ", : , . .My family and I were enjoying our afternoon at home during my day off on 28 Sep 2020. This peacefulness was interrupted when we suddenly heard screams of a woman coming from downstairs. My house on the third floor overlooks the carpark. As I peered out, a shocking sight greeted me a young lady was frantically fleeing from a knife-wielding man!The woman was screaming and clearly in distress. I know this might sound quite dramatic but I quickly dashed out of the house while telling my family members I need to go down, I need to save the girl!.It wasnt wise to confront a man with a knife alone so as I ran past some migrant workers who were working nearby, I asked if they had anything I could use to protect myself. They quickly handed me a hoe from their worksite and I ran towards the couple.Once at the carpark, I saw that a driver had stopped and used his car to block the man from reaching the woman. The man was still waving his knife and shouting incoherently.A crowd had already formed by then. For everyones safety, I knew I had to defuse the situation as soon as possible. I addressed him calmly. Im a police officer. Please drop your knife.Suddenly, he began charging towards me with his knife. Fortunately, I managed to deflect his blow by quickly swinging the hoe at him. He backed away. I saw the mans eyes darting around when he realised that there wasnt anywhere for him to run. The crowd had him surrounded. In a panic, he pointed the knife towards himself and started slashing at his own arms.I took this chance to quickly grab his wrist and disarmed him. Some nearby onlookers then rushed in and together we successfully subdued the man. Soon enough, police officers arrived and arrested him. Both the man and woman were later brought to a hospital to treat their injuries. [To be continued in comment section]",
        "cleaned_caption": "My family and I were enjoying our afternoon at home during my day off on 28 Sep 2020. This peacefulness was interrupted when we suddenly heard screams of a woman coming from downstairs. My house on the third floor overlooks the carpark. As I peered out, a shocking sight greeted me; a young lady was frantically fleeing from a knife-wielding man! The woman was screaming and clearly in distress. I know this might sound quite dramatic but I quickly dashed out of the house while telling my family members I need to go down, I need to save the girl! It wasn't wise to confront a man with a knife alone so as I ran past some migrant workers who were working nearby, I asked if they had anything I could use to protect myself. They quickly handed me a hoe from their worksite and I ran towards the couple. Once at the carpark, I saw that a driver had stopped and used his car to block the man from reaching the woman. The man was still waving his knife and shouting incoherently. A crowd had already formed by then. For everyone's safety, I knew I had to defuse the situation as soon as possible. I addressed him calmly. I'm a police officer. Please drop your knife. Suddenly, he began charging towards me with his knife. Fortunately, I managed to deflect his blow by quickly swinging the hoe at him. He backed away. I saw the man's eyes darting around when he realised that there wasn't anywhere for him to run. The crowd had him surrounded. In a panic, he pointed the knife towards himself and started slashing at his own arms. I took this chance to quickly grab his wrist and disarmed him. Some nearby onlookers then rushed in and together we successfully subdued the man. Soon enough, police officers arrived and arrested him. Both the man and woman were later brought to a hospital to treat their injuries. [To be continued in comment section]",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What action is being performed by the person with the watch in the image?\n",
        "question_and_answers": {
            "question_0": "What action is being performed by the person with the watch in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1198.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1198.jpg",
        "caption": ", : & / . . .SGT Ayden Goh (A): This incident happened on 15 Aug 2021. Nick and I overheard a member of the public informing our counter officer that she saw an elderly man at one of the blocks nearby who looked like he needed some assistance.V/SGT Nick Koh (N): Ayden and I quickly headed over to see if we could offer help.A: We soon found the elderly man sitting on a bench under one of the blocks. He looked to be in his seventies and seemed a little short of breath. He was unable to tell us his address.N: We learnt that he had lodged a report regarding his missing phone at the NPC earlier, so we checked with our counter officer for his address and details of his next-of-kin.A: We helped him up but he suddenly lost consciousness and collapsed on me. I quickly grabbed hold of him before he hit the floor.N: We checked for his pulse. There was no breathing. We had to act fast and I immediately initiated CPR on him. Although this was my first time doing so, I was surprised that I did not have any fear and my first-aid training had kicked in allowing me to act instantly.A: While Nick was attending to the man, I called for an ambulance and relayed the information to the rest of my team. I then rushed to grab the nearest AED and set it up as Nick continued to do the compressions.N: I knew that these first few minutes were extremely crucial and my thoughts were just focused on saving the man.A: Yes, the reality struck me that his life was at stake.N: Paramedics soon arrived but we were still unable to resuscitate him before he was conveyed to the hospital.A: I felt quite affected by the whole incident. I found myself asking whether there was anything else we could have done more or have acted sooner. Nick came to assure me that we did the best we could.[continued]",
        "cleaned_caption": "SGT Ayden Goh (A): This incident happened on 15 Aug 2021. A member of the public informed our counter officer that she saw an elderly man at one of the blocks nearby who looked like he needed some assistance. V/SGT Nick Koh (N): Ayden and I quickly headed over to see if we could offer help. A: We soon found the elderly man sitting on a bench under one of the blocks. He looked to be in his seventies and seemed a little short of breath. He was unable to tell us his address. N: We learnt that he had lodged a report regarding his missing phone at the NPC earlier, so we checked with our counter officer for his address and details of his next-of-kin. A: We helped him up but he suddenly lost consciousness and collapsed on me. I quickly grabbed hold of him before he hit the floor. N: We checked for his pulse. There was no breathing. We had to act fast and I immediately initiated CPR on him. Although this was my first time doing so, I was surprised that I did not have any fear and my first-aid training had kicked in allowing me to act instantly. A: While Nick was attending to the man, I called for an ambulance and relayed the information to the rest of my team. I then rushed to grab the nearest AED and set it up as Nick continued to do the compressions. N: I knew that these first few minutes were extremely crucial and my thoughts were just focused on saving the man. A: Yes, the reality struck me that his life was at stake. N: Paramedics soon arrived but we were still unable to resuscitate him before he was conveyed to the hospital. A: I felt quite affected by the whole incident. I found myself asking whether there was anything else we could have done more or have acted sooner. Nick came to assure me that we did the best we could.",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What is the action being performed on the individual lying down?\n",
        "question_and_answers": {
            "question_0": "What is the action being performed on the individual lying down?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1213.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1213.jpg",
        "caption": ", : & . . SGT Nur Fadilah (N): It was about 10pm on 22 June when we received a call telling us that a unit at Marsiling Crescent was on fire. Franco was my patrol partner that night. Hes a full-time Police National Serviceman who joined the Woodlands West NPC just two months ago. SC Franco Kam (F): Being a GRF officer has been an eye-opening experience! I felt quite assured being with Fadilah as we headed to the scene. Shes been in the Force for over 13 years. N: As we entered the carpark, we saw a group of residents had already gathered at the foot of the block. I looked up and saw thick black smoke coming out from the unit on the second floor. N: When they saw our vehicle, the residents started waving at us to get our attention. One of the residents urgently told us that there were people still trapped in the unit. We had to act fast. F: It was shocking to see that the smoke had reached all the way down to the first floor lift landing. With a fire extinguisher in hand, I ran up the stairwell together with Fadilah. N: Outside the unit, the smoke was tremendously thick and we had poor visibility. Franco started calling out Is there anyone inside?. That was when we heard cries coming from the living room. F: We didnt think twice. Both of us immediately dashed into the burning unit towards the sound of the crying child. I searched around with my torchlight and saw a small boy curled up on the living room floor. N: I remembered thinking how much the boy reminded me of my three-year-old son at home and how important it was to get him to safety. He grabbed on to me tightly as I quickly carried him on my shoulders and ran out of the house. [continued]",
        "cleaned_caption": "SGT Nur Fadilah (N): It was about 10pm on 22 June when we received a call telling us that a unit at Marsiling Crescent was on fire. Franco was my patrol partner that night. He’s a full-time Police National Serviceman who joined the Woodlands West NPC just two months ago. SC Franco Kam (F): Being a GRF officer has been an eye-opening experience! I felt quite assured being with Fadilah as we headed to the scene. She’s been in the Force for over 13 years. N: As we entered the carpark, we saw a group of residents had already gathered at the foot of the block. I looked up and saw thick black smoke coming out from the unit on the second floor. N: When they saw our vehicle, the residents started waving at us to get our attention. One of the residents urgently told us that there were people still trapped in the unit. We had to act fast. F: It was shocking to see that the smoke had reached all the way down to the first floor lift landing. With a fire extinguisher in hand, I ran up the stairwell together with Fadilah. N: Outside the unit, the smoke was tremendously thick and we had poor visibility. Franco started calling out \"Is there anyone inside?\". That was when we heard cries coming from the living room. F: We didn’t think twice. Both of us immediately dashed into the burning unit towards the sound of the crying child. I searched around with my torchlight and saw a small boy curled up on the living room floor. N: I remembered thinking how much the boy reminded me of my three-year-old son at home and how important it was to get him to safety. He grabbed on to me tightly as I quickly carried him on my shoulders and ran out of the house. [continued]",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What kind of communication device is being used by the person in the image?\n",
        "question_and_answers": {
            "question_0": "What kind of communication device is being used by the person in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1215.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1215.jpg",
        "caption": ", : & . . SGT Nur Fadilah (N): It was about 10pm on 22 June when we received a call telling us that a unit at Marsiling Crescent was on fire. Franco was my patrol partner that night. Hes a full-time Police National Serviceman who joined the Woodlands West NPC just two months ago. SC Franco Kam (F): Being a GRF officer has been an eye-opening experience! I felt quite assured being with Fadilah as we headed to the scene. Shes been in the Force for over 13 years. N: As we entered the carpark, we saw a group of residents had already gathered at the foot of the block. I looked up and saw thick black smoke coming out from the unit on the second floor. N: When they saw our vehicle, the residents started waving at us to get our attention. One of the residents urgently told us that there were people still trapped in the unit. We had to act fast. F: It was shocking to see that the smoke had reached all the way down to the first floor lift landing. With a fire extinguisher in hand, I ran up the stairwell together with Fadilah. N: Outside the unit, the smoke was tremendously thick and we had poor visibility. Franco started calling out Is there anyone inside?. That was when we heard cries coming from the living room. F: We didnt think twice. Both of us immediately dashed into the burning unit towards the sound of the crying child. I searched around with my torchlight and saw a small boy curled up on the living room floor. N: I remembered thinking how much the boy reminded me of my three-year-old son at home and how important it was to get him to safety. He grabbed on to me tightly as I quickly carried him on my shoulders and ran out of the house. [continued]",
        "cleaned_caption": "SGT Nur Fadilah (N): It was about 10pm on 22 June when we received a call telling us that a unit at Marsiling Crescent was on fire. Franco was my patrol partner that night. He's a full-time Police National Serviceman who joined the Woodlands West NPC just two months ago. SC Franco (F): Being a GRF officer has been an eye-opening experience! I felt quite assured being with Fadilah as we headed to the scene. She's been in the Force for over 13 years. N: As we entered the carpark, we saw a group of residents had already gathered at the foot of the block. I looked up and saw thick black smoke coming out from the unit on the second floor. N: When they saw our vehicle, the residents started waving at us to get our attention. One of the residents urgently told us that there were people still trapped in the unit. We had to act fast. F: It was shocking to see that the smoke had reached all the way down to the first floor lift landing. With a fire extinguisher in hand, I ran up the stairwell together with Fadilah. N: Outside the unit, the smoke was tremendously thick and we had poor visibility. Franco started calling out, \"Is there anyone inside?\". That was when we heard cries coming from the living room. F: We didn't think twice. Both of us immediately dashed into the burning unit towards the sound of the crying child. I searched around with my torchlight and saw a small boy curled up on the living room floor. N: I remembered thinking how much the boy reminded me of my three-year-old son at home and how important it was to get him to safety. He grabbed on to me tightly as I quickly carried him on my shoulders and ran out of the house. [continued]",
        "generated_caption": "REMOVE_IMAGE",
        "dialogue_history": "question_0: What type of law enforcement operation is depicted in the image?\n",
        "question_and_answers": {
            "question_0": "What type of law enforcement operation is depicted in the image?"
        }
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1259.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1259.jpg",
        "caption": "ASP Shasha (S): I remembered a light drizzle had just stopped on the night of 30 July 2021. Poh and I were driving around the Woodlands industrial area when we noticed a man in a Grab rider uniform standing at the roadside pavement. He appeared to be in pain and kept pointing to his ribcage area. We quickly parked our car to check on him. Strangely, he couldnt seem to respond properly to our questions. Thats when we learned he had a hearing disability. SSS Poh (P): We ended up communicating by typing out text messages on the phone. I remember the first thing I typed was are you injured? We learned that he was cycling while delivering food, but lost control and fell. He had some abrasions on his elbows and legs, so we asked him to lie down as we rendered some light first aid.S: Poh is the kind of officer who likes to bao ka liao (does everything) We also made a check with POCC to review the footage of the nearby PolCam to ensure he wasnt a victim of any hit-and-run accident. P: We were concerned that he might have suffered internal injuries, so we called for an ambulance. The man then gestured towards his bag to say that he still had to complete his food delivery order! I gave a call to Grab and explained the situation to them. I also gave a call to the mans next-of-kin and assured them that hes safe and will be brought to the nearby hospital. S: Then we realised - what do we do with his bicycle and the delivery? So we kept the bicycle safely locked and left a note to ensure it wouldnt be taken away. Unfortunately, we had to dispose of the food order. The ambulance soon came. After explaining to the paramedics, we bade him a safe farewell. P: A few days later, we learned that the man had turned up at the NPC to pass us a handwritten note personally addressed to SC/CPL Xie Sibin, who had also assisted us in attending to the man that day. It was quite heartwarming. S: It was nice and Im thankful for having a good team. Though I have to say that we dont do this just because were on duty. When we see someone in need, in pain or at loss its only human for us to offer help!mydutymycalling singaporepoliceforcesafeguardingeveryday",
        "cleaned_caption": "ASP: I remembered a light drizzle had just stopped on the night of 30 July 2021. My colleague and I were driving around the Woodlands industrial area when we noticed a man in a Grab rider uniform standing at the roadside pavement. He appeared to be in pain and kept pointing to his ribcage area. We quickly parked our car to check on him. Strangely, he couldn't seem to respond properly to our questions. That's when we learned he had a hearing disability. We ended up communicating by typing out text messages on the phone. I remember the first thing I typed was \"are you injured?\" We learned that he was cycling while delivering food but lost control and fell. He had some abrasions on his elbows and legs, so we asked him to lie down as we rendered some light first aid. My colleague is the kind of officer who likes to bao ka liao (does everything). We also made a check with POCC to review the footage of the nearby PolCam to ensure he wasn't a victim of any hit-and-run accident. We were concerned that he might have suffered internal injuries, so we called for an ambulance. The man then gestured towards his bag to say that he still had to complete his food delivery order! I gave a call to Grab and explained the situation to them. I also called the man's next-of-kin and assured them that he's safe and will be brought to the nearby hospital. Then we realized - what do we do with his bicycle and the delivery? So we kept the bicycle safely locked and left a note to ensure it wouldn't be taken away. Unfortunately, we had to dispose of the food order. The ambulance soon came. After explaining to the paramedics, we bade him a safe farewell. A few days later, we learned that the man had turned up at the NPC to pass us a handwritten note personally addressed to a senior officer, who had also assisted us in attending to the man that day. It was quite heartwarming. It was nice and I'm thankful for having a good team. Though I have to say that we don't do this just because we're on duty. When we see someone in need, in pain, or at a loss, it's only human for us to offer help! #mydutymycalling #singaporepoliceforce #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1604.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1604.jpg",
        "caption": "From using scavenged equipment left behind from World War II, the SPF has come a long way in developing its radio communication capabilities. With the integration of new technologies and processes, the SPFs command and control coordination and capabilities have evolved tremendously! Swipe left to see the changes from 1940s to 1950s to 2000s till today. More on how it happened, and what lies beyond 2020 in the link on our bio and IGstory! singaporepoliceforce safeguardingeveryday thursday",
        "cleaned_caption": "From using scavenged equipment left behind from World War II, the SPF has come a long way in developing its radio communication capabilities. With the integration of new technologies and processes, the SPF's command and control coordination and capabilities have evolved tremendously! Swipe left to see the changes from 1940s to 1950s to 2000s till today. More on how it happened, and what lies beyond 2020 in the link on our bio and IG story! #singaporepoliceforce #safeguardingeveryday #thursday",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1726.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1726.jpg",
        "caption": "Deputy Assistant Commissioner of Police, Serene Chiu, is just one of six policewomen featured in a special edition of the Police Life Magazine. Link in bio and also through our Instastories 70YearsofWomeninPolicing safeguardingeveryday singaporepoliceforce",
        "cleaned_caption": "Deputy Assistant Commissioner of Police is just one of six policewomen featured in a special edition of the Police Life Magazine. Link in bio and also through our Instastories 70YearsofWomeninPolicing safeguardingeveryday singaporepoliceforce",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1829.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1829.jpg",
        "caption": "Police NSF Hazim had no thoughts at all of joining the Singapore Police Force prior to his National Service (NS) stint. However, that changed after he met Senior Staff Sergeant (SSSgt) Aziz, his Course Manager at Training Command, and began his NS experience with the In-Situ Reaction Team of Protective Security Command (ProCom).His stint has exposed him to the wider roles that the Singapore Police Force plays in keeping the nation safe, especially so in ProCom where the responsibility stretches to counter-terrorism work and keeping key installations secure. The distinct spirit present in his team in a time where the security climate is uncertain further solidifies his decision to serve with the force. Hazim hopes that he can be posted back to ProCom one day so that he would be able to share and inspire other PNSFs on the work of the Singapore Police Force, just like his mentor SSSGT Aziz did. singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "Police NSF had no thoughts at all of joining the Singapore Police Force prior to his National Service (NS) stint. However, that changed after he met Senior Staff Sergeant (SSSgt), his Course Manager at Training Command, and began his NS experience with the In-Situ Reaction Team of Protective Security Command (ProCom). His stint has exposed him to the wider roles that the Singapore Police Force plays in keeping the nation safe, especially so in ProCom where the responsibility stretches to counter-terrorism work and keeping key installations secure. The distinct spirit present in his team in a time where the security climate is uncertain further solidifies his decision to serve with the force. He hopes that he can be posted back to ProCom one day so that he would be able to share and inspire other PNSFs on the work of the Singapore Police Force, just like his mentor SSSGT did. #singaporepoliceforce #safeguardingeveryday",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1851.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1851.jpg",
        "caption": "Fathers serve as role models and sounding boards in the childrens growing years. We wish all fathers a Happy Fathers Day. Meet SSI Mohd Fuat and his two children, SSGT Nur Adelina and SSGT Mohd Iraimi. SSI Mohd Fuat is the Deputy Officer-in-Charge of the Community Policing Unit at . Both SSGT Nur Adelina and SSGT Mohd Iraimi are with the Traffic Police Department. Curious to find out what the young officers have to say to their father? Stay tuned to our IG story!",
        "cleaned_caption": "Fathers serve as role models and sounding boards in the children's growing years. We wish all fathers a Happy Father's Day. Meet SSI Mohd Fuat and his two children, both SSGT with the Traffic Police Department. SSI Mohd Fuat is the Deputy Officer-in-Charge of the Community Policing Unit. Curious to find out what the young officers have to say to their father? Stay tuned to our IG story!",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1868.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1868.jpg",
        "caption": "Senior Assistant Commissioner of Police (SAC) Florence Chua Siew Lian will take on the appointment of Director of Criminal Investigation Department (CID) with effect from 1 June 2018. SAC Florence Chua will also assume a concurrent appointment as Deputy Commissioner (Investigations and Intelligence) on the same day. She will be the first female Director of CID and Deputy Commissioner of Police.singaporepoliceforce",
        "cleaned_caption": "Senior Assistant Commissioner of Police (SAC) will take on the appointment of Director of Criminal Investigation Department (CID) with effect from 1 June 2018. SAC will also assume a concurrent appointment as Deputy Commissioner (Investigations and Intelligence) on the same day. She will be the first female Director of CID and Deputy Commissioner of Police.",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1891.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1891.jpg",
        "caption": "You miss 100% of the shots you dont take. Have courage and take one step closer towards your dream today. We will protect you. singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "You miss 100% of the shots you don't take. Have courage and take one step closer towards your dream today. We will protect you. #singaporepoliceforce #safeguideveryday",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1924.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1924.jpg",
        "caption": "TGIF ! While we are eyeing the weekend, Dairy, our K-9 Explosive Detector Dog, has her eye on her target. Police K-9 dog handlers put in time and effort during training to understand their dog partners so that they can operate effectively together. singaporepoliceforce safeguardingeveryday policek9",
        "cleaned_caption": "TGIF! While we are eyeing the weekend, Dairy, our K-9 Explosive Detector Dog, has her eye on her target. Police K-9 dog handlers put in time and effort during training to understand their dog partners so that they can operate effectively together. #singaporepoliceforce #safeguardingeveryday #policek9",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_1993.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_1993.jpg",
        "caption": "It's all about the mindset and endurance that help our Public Order troopers from the Special Operations Command carry out the fire confidence drill. This ensures that they are ready to take on any public order incidents. singaporepoliceforce safeguardingeveryday",
        "cleaned_caption": "It's all about the mindset and endurance that help our Public Order troopers from the Special Operations Command carry out the fire confidence drill. This ensures that they are ready to take on any public order incidents. #sgpolice #safeguardingEveryday",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2063.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2063.jpg",
        "caption": "To commemorate 50 years of National Service (NS50) this year, Police National Service alumni from the Singapore Police Forces Officer Cadet, 1980 Batch, had their 37th reunion at the Senior Police Officers Mess in January. Find out more from our post on SPF Facebook page! OurHomeOurTeam PoliceNationalService NS50",
        "cleaned_caption": "To commemorate 50 years of National Service (NS50) this year, Police National Service alumni from the Singapore Police Forces Officer Cadet, 1980 Batch, had their 37th reunion at the Senior Police Officers Mess in January. Find out more from our post on SPF Facebook page! OurHomeOurTeam PoliceNationalService NS50",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2139.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2139.jpg",
        "caption": "CHANGE OF COMMAND CEREMONY AT BEDOK DIVISION Assistant Commissioner (AC) Tan Tin Wee (bottom right) will assume the Command of Bedok Division on 1 November 2016. He takes over from AC Alvin Moh (top left) who will be moving on to assume the appointment of Director, Planning and Organisation Department. Read more on SPF FB.spfpoliceeventsingaporepoliceforce",
        "cleaned_caption": "CHANGE OF COMMAND CEREMONY AT BEDOK DIVISION Assistant Commissioner (AC) Tan Tin Wee (bottom right) will assume the Command of Bedok Division on 1 November 2016. He takes over from AC who will be moving on to assume the appointment of Director, Planning and Organisation Department. Read more on SPF FB.",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2165.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2165.jpg",
        "caption": "ASP Tan Hoe Chye, Supt Goh Tat Boon and SSI Mohammed Noh bin Abdullah (left to right) were among the 144 officers who were appointed onto the Expert Career Track at the inaugural SPF Expert Track Appointment Ceremony 2016 held this morning. The 144 officers include two Experts, 25 Principal Specialists and 117 Senior Specialists who come from various SPF units. Read more on SPF FB! singaporepoliceforce",
        "cleaned_caption": "ASP Tan Hoe Chye, Supt Goh Tat Boon and SSI Mohammed Noh bin Abdullah (left to right) were among the 144 officers who were appointed onto the Expert Career Track at the inaugural SPF Expert Track Appointment Ceremony 2016 held this morning. The 144 officers include two Experts, 25 Principal Specialists and 117 Senior Specialists who come from various SPF units.",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2196.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2196.jpg",
        "caption": "Commanding Officer of Bukit Panjang NPC, Superintendent (SUPT) Jeffrey Chye, calls out to Bukit Panjang residents to join crime prevention efforts. Together we can make Bukit Panjang a safer and secured neighbourhood to live in! Visit the link in our profile to find out more about SUPT Jeffrey Chye and what he has to share. singaporepoliceforce bukitpanjangnpc",
        "cleaned_caption": "Commanding Officer of Bukit Panjang NPC, Superintendent, calls out to Bukit Panjang residents to join crime prevention efforts. Together we can make Bukit Panjang a safer and secured neighbourhood to live in! Visit the link in our profile to find out more about what he has to share. #singaporepoliceforce #bukitpanjangnpc",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2292.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2292.jpg",
        "caption": "Assistant Commissioner of Police (AC) Cheong Chee Ming has assumed command of Airport Police Division as Commander, Airport Police Division yesterday, 16 November 2015. AC Cheong, 47, has served 21 years in SPF holding several key appointments.singaporepoliceforce",
        "cleaned_caption": "Assistant Commissioner of Police (AC) has assumed command of Airport Police Division as Commander, Airport Police Division yesterday, 16 November 2015. AC has served 21 years in SPF holding several key appointments.",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2306.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2306.jpg",
        "caption": "DSP Ho Ban Hsiung and INSP Ramesh Vincent nabbed sex scammer who had duped victims into providing their ATM cards and PIN to launder illegal proceeds. Read more on the SPF Facebook: singaporepoliceforce spfpride",
        "cleaned_caption": "DSP Ho Ban Hsiung and INSP nabbed sex scammer who had duped victims into providing their ATM cards and PIN to launder illegal proceeds. Read more on the SPF Facebook.",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2323.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2323.jpg",
        "caption": "\"Persevere. When faced with difficulties, hang in there and things will always get better.\" - Crime Control Unit Officer SSgt Seow Yee Lin Patricia singaporepoliceforce",
        "cleaned_caption": "\"Persevere. When faced with difficulties, hang in there and things will always get better.\" - Crime Control Unit Officer",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2364.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2364.jpg",
        "caption": "\"Our work is intense, and we have to remind ourselves to take a break at times to keep our minds fresh to crack a case!\" - ASP Zeya Lwin Tun, Investigating Officer from Central Div singaporepoliceforce",
        "cleaned_caption": "\"Our work is intense, and we have to remind ourselves to take a break at times to keep our minds fresh to crack a case!\" - ASP, Investigating Officer from Central Division Singapore Police Force",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2366.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2366.jpg",
        "caption": "DSP Koon Beng was out with his family when he saw a woman crying and pulling desperately at the door handles of a car. Find out how he ended up saving a baby at our SPF Facebook page.singaporepoliceforce spfpride",
        "cleaned_caption": "DSP Koon Beng was out with his family when he saw a woman crying and pulling desperately at the door handles of a car. Find out how he ended up saving a baby at our SPF Facebook page.",
        "generated_caption": "REMOVE_IMAGE"
    },
    {
        "image_path": "internal_departments/singaporepoliceforce_pictures/singaporepoliceforce_2392.jpg",
        "image_url": "https://raw.githubusercontent.com/internal-departments/singaporepoliceforce-pictures/master/singaporepoliceforce_2392.jpg",
        "caption": "As a member of the Airport Division's Patrol Team, Special Constable Corporal (SC/CPL) Marah Moehammad Ishraf helps maintain law and order at our airport. Congratulations to SC/CPL Marah Moehammad Ishraf for winning the Bronze medal in the SEA Games Men's Rugby Sevens! singaporepoliceforce seagames2015 28thseagames",
        "cleaned_caption": "As a member of the Airport Division's Patrol Team, Special Constable Corporal (SC/CPL) helps maintain law and order at our airport. Congratulations to SC/CPL for winning the Bronze medal in the SEA Games Men's Rugby Sevens! #singaporepoliceforce #seagames2015 #28thseagames",
        "generated_caption": "REMOVE_IMAGE"
    }
]